import 'package:flutter/material.dart';
//import 'StutteringDetailScreen.dart'; // Import the new screen
import '../theme.dart'; // Import your custom theme

class StutteringScreen extends StatelessWidget {
  final bool isChildModeActive;
  final void Function(bool) toggleDarkMode;
  final void Function(bool) toggleChildMode;
  final bool isDarkModeActive;

  StutteringScreen({
    required this.isChildModeActive,
    required this.toggleDarkMode,
    required this.toggleChildMode,
    required this.isDarkModeActive,
  });
  // Define a list of maps with button names and pre-filled texts
  final List<Map<String, String>> buttonsData = [
    {
      "name": "خطوات تعليم الاطفال نطق الكلمات الاولي | تنمية الحصيلة اللغوية",
      "text":
          """تعليم الأطفال نطق الكلمات الأولى من الأمور التي تهم أولياء الأمور وخاصة عندما تكون أعمار طفلهم من سنتين وحتي 3 سنوات، فيسعوا جاهدين إلي مراقبة النمو اللغوي لأطفالهم وملاحظة كلامهم ومحاولة تعليمهم العديد من الأمور التي تساعد علي تنمية اللغة لديهم، وعلي رأسها تعليم الأطفال نطق الكلمات الأولى أو ما يعرف بتنمية الحصيلة اللغوية. مراحل تطور الحصيلة اللغوية عند الأطفال: تمر الحصيلة اللغوية (عدد الكلمات التي يعرفها الطفل) بالعديد من المراحل وفقاً لعمر الطفل، فعند سن السنة الواحد، تكون بداية نطق الطفل لأول كلمة مقصودة فيه حياته، ثم عند عمر سنتين، تتطور الحصيلة اللغوية لتقع ما بين 50 إلي 200 كلمة، ثم تتطور بقدر هائل عند عمر 3 سنوات لتصل حتى 900 كلمة. تطور الحصيلة اللغوية عند الأطفال انفوجرافيك يوضح تطور الحصيلة اللغوية عند الأطفال وفقاً للعمر فيما يلي، نوضح خطوات تعليم الأطفال نطق الكلمات الأولى وتنمية الحصيلة اللغوية لديهم من خلال تدريبهم علي المجموعات الضمنية المختلفة مثل: الخضروات والفواكه والطعام والطيور والحيوانات والطيور والمواصلات. خطوات تعليم الأطفال نطق الكلمات الأولى: تتمثل خطوات تعليم الأطفال نطق الكلمات الأولى فيما يلي: الهدف: علي سبيل المثال، تعليم الطفل كلمة “كورة“. 1- مرحلة التعرف: وهي المرحلة التي يتعرف فيها الطفل علي اسم الشئ ، بحيث يربط بين الأسم الذي يسمعه بالشكل الذي يراه. مثال: أحضر كرة، وأنطق اسمها امام الطفل: “كورة”،”دي كورة. (حتي يربط الاسم بشكل، يعرف ان ذلك الشئ اسمه كورة). 2- مرحلة التمييز: وفيها يستطيع الطفل تمييز الشيء عن باقي الأشياء الأخرى، وذلك عن طريق أن نطلب من الطفل أن يحضر الشيء من ضمن العديد من الأشياء الأخرى، مع مراعاة زيادة الأشياء بالتدريج. مثال: ضع الكرة مع شيء آخر، واطلب من الطفل أن يحضر الكرة فقط، ثم قم بزيادة عدد الأشياء التي بجانب الكرة تدريجياً إلى شيئين، وثلاثة، وأربعة أشياء في كل مرة ينجح الطفل في تمييز الكرة وإحضارها من بينهم. 3- مرحلة التسمية: وفي هذه المرحلة، يستطيع الطفل أن ينطق اسم الشيء عند سؤاله عنه. يجب أن يكون مستوى الطفل جيدًا في مرحلة التعرف والتمييز السابقتين، حتى يستطيع توظيف الكلمة واستخدامها في حياته ونطقها عندما يريد. بدلاً من أن يكون مُرددًا لاسم الشيء معك فقط بدون معرفته الجيدة له أو تمييزه الجيد له. مثال: أحضر كرة وأسأل الطفل: “ايه دي؟”. شجعه علي نطق اسمها: “كورة”. 4- مرحلة التعميم: يقوم الطفل بتعميم المفهوم عن طريق معرفة الشيء بكل أشكاله وأحجامه وألوانه. وإذا تغيرت تلك الخصائص، يدرك الطفل أن الشيء لا يزال يُسمى بنفس الاسم. مثال: أحضر العديد من الكرات مثل: كرة بينج بونج، كرة سلة، كرة تنس، كرة قدم. حتى يعرف الطفل أن كل هذه الأشكال والألوان تُسمى بنفس الاسم، وهو “كرة”. في نهاية المطاف، باتباع هذه المراحل، يمكننا ببساطة تعليم الأطفال نطق كلمات وأسماء الأشياء من حولهم جميعًا، وخاصة الأطفال الذين يعانون من تأخر الكلام. وذلك عن طريق معرفة ونطق وتمييز الكثير من الكلمات بفهم وباستيعاب صحيح. وبهذا يكون الطفل قادرًا على استخدام الكلمات بشكل فعّال وتوظيفها، بدلاً من تكرار الأصوات والكلمات بدون فهم معناها
.""",
    },
    {
      "name": "DYSARTHRIA و الديسارثريا APRAXIA الفرق بين الأبراكسيا",
      "text": """"تعتبر “الأبراكسيا” و”والديسارثريا
” من الموضوعات الهامة والشائكة
والمحيرة في مجال التخاطب والنطق.
وإنهاءاً لتلك الحيرة، يتضمن المقال
توضيحًا شاملًا للفرق بين الأبراكسيا
والديسارثريا وكيفية التعامل معهما من
خلال التقييم والعلاج. مع تسليط الضوء
على الأسباب المحتملة لكل اضطراب،
والأعراض التي يمكن أن تظهر مع كل منهما.
وكذلك أهمية التدخل المبكر والعلاج
الشامل لتحسين قدرة الأفراد على التي
تعاني من تلكا المشكلتين علي التواصل
والنطق.
وما يلي الفرق بين الأبراكسيا Apraxia
والديسارثريا Dysarthria من حيث التعريف
والأسباب والأنواع والأعراض وطرق
التدخل والتأهيل المناسبة.
     أولاً: الأبراكسيا Apraxia
     ثانياً: الديسارثريا Dysarthria
     ثالثاً: الفرق بين الأبراكسيا Apraxia
والديسارثريا Dysarthria
أولاً: الأبراكسيا APRAXIA:
الأبراكسيا (Apraxia) هي حالة اضطراب في
التحكم الحركي الدقيق والتنسيق العصبي
لعمليات الحركة المعقدة والمتعلقة
بالنطق. يعاني الأشخاص الذين يعانون من
هذا الاضطراب من صعوبة في التخطيط
والتنفيذ الدقيق للحركات المتطلبة
لإنتاج الكلمات والأصوات بشكل صحيح.
الأبراكسيا تؤثر على القدرة على التحكم
في حركات العضلات المختلفة المشاركة في
عملية النطق، مثل: تحريك اللسان
والشفتين والفكين بشكل مناسب لإنتاج
الأصوات والكلمات بطريقة مفهومة. فيصبح
من الصعب على الأشخاص المصابين
بالأبراكسيا التحكم في تسلسل الحركات
والتنسيق بينها، مما يؤدي إلى ظهور
أخطاء في النطق والكلام.
وللأبراكسيا العديد من المسميات منها:
     الطفل الأخرق.
     الطفل ثقيل الحركة.
     إضطراب التنسيق النمائى.
المشكلات التي تواجه الأبراكسيا:
     التناسق الحركي: يظهر في ضعف القدرة
على تنظيم وتنسيق الحركات العضلية
المختلفة المشاركة في عملية النطق، حيث
يجد الفرد صعوبة في تنسيق حركة أعضاء
النطق لأخراج الأصوات بشكل صحيح. على
سبيل المثال: عند محاولة نطق الحرف “ب”
قد ينطقها بحرف آخر مثل: “م” بدلاً من
“ب”.
     المدى الحركي: يشير إلي ضعف القدرة على
التحكم في مدى واتجاه الحركة، حيث يجد
الفرد صعوبة في تنظيم فتح وغلق الفم
بشكل صحيح أثناء النطق. على سبيل المثال:
عند محاولة نطق الكلمة “لا”، قد يجد
الطفل صعوبة في تحديد مقدار اندفاع
اللسان إلى الخارج.
     التخطيط الحركي: يظهر في ضعف القدرة
على تنسيق الحركات العضلية اللازمة
لإنتاج كلمة أو صوت معين، حيث يصبح من
الصعب على الطفل تحديد كيفية إخراج
الأصوات بشكل صحيح. وقد يعتمد الفرد على
مهارات التقليد الحركي لمحاولة تكوين
الحركات الصحيحة.
أنواع الأبراكسيا:
تشير الأبراكسيا إلى اضطراب في عملية
النطق والتحكم في الحركات اللفظية
المختلفة، وهناك نوعان رئيسيان من
الأبراكسيا يمكن التفرقة بينهما:
     الأبراكسيا اللفظية أو أبراكسيا
الكلام (CAS – CHILDHOOD APRAXIA OF SPEECH): يتسم هذا
النوع بأنه اضطراب في نطق الأصوات
والمقاطع والكلمات لدى الأطفال. في هذه
الحالة، يواجه الطفل صعوبة في ترتيب
الأصوات بشكل صحيح أثناء الكلام. على
سبيل المثال، عند محاولة نطق الحرف
“ت”، قد ينطقه بشكل خاطئ مثل “د”،
وهذا يظهر على شكل أخطاء صوتية غير
ثابتة.
     الأبراكسيا الفموية (ORAL APRAXIA): يؤثر هذا
النوع على قدرة الفرد على تحريك عضلات
الفم لأغراض غير الكلام. يعاني الطفل
المصاب بالأبراكسيا الفموية من صعوبة
في أداء حركات الفم المعتادة مثل:
السعال، البلع، تحريك اللسان، وحتى
التقبيل عند الطلب. ومع ذلك، قد يقوم
بتلك الحركات دون أن يدرك ذلك. كما يمكن
أن تتفاوت حدة هذا النوع من الأبراكسيا،
حيث يمكن أن تكون شديدة بما يكفي لعرقلة
الكلام بالكامل أو تكون بسيطة تؤثر فقط
على لفظ الكلمات الطويلة والمعقدة.
 
أعراض الأبراكسيا:
تختلف الأعراض من طفلاً لآخر،
فالعلامات التالية ربما قد لا تظهر كلها
عند الطفل، لذلك من الضروري أن يتم
تشخيص الطفل من قِبل الطبيب أو أخصائي
النطق واللغة الذي لديه المعرفة ليجزم
بوجود المشكلة. والجدير بالذكر أنه في
حالة الأطفال الصغار جدًا الذين تقل
أعمارهم عن عامين، قد يأخر الأطباء في
البداية التشخيص للتأكد من أنه ليس مجرد
تطور لغوي بطيء (تأخر لغوي). علي كل حال،
تتمثل الأعراض العامة للأبراكسيا فيما
يلي:
     أخطاء صوتية غير ثابتة في السواكن
والمتحركات.
     لا يوجد أي ضعف في أعضاء الكلام (oral motor).
     فصل المقاطع داخل الكلمة الواحدة.
     اللغة الاستقبالية أفضل من اللغة
التعبيرية.
     يبدل الأصوات الصعبة بأخرى سهلة أو
يحذفها ولديه صعوبة في تقليد الكلام أو
الحركات.
     تظهر وقفات طويلة بين الأصوات.
     ربما توجد مشاكل في الأكل.
     زيادة أو قلة الإحساس بالفم ويرفض
تفريش الأسنان أو الأكل الصلب ولا يتعرف
على مذاق الأشياء بفمه وربما يتلمس
أعضاء النطق عند إنتاج الأصوات.
     الكلام التلقائي غير واضح.
     لديه صعوبة في نطق الكلمات المركبة أو
الجمل.
     تظهر الصعوبة أكثر عندما يكون قلقًا.
     يصعب عليه فهم الأشياء غير المألوفة.
     يتأخر في تطوير اللغة.
     الأصوات رتيبة ويضغط على المقاطع
الخاطئة.
     كلمات خاطئة صعوبة في إنتاجها
واسترجاعها.
     عدم قدرة الفرد على التلويح وتقليد
الحركات.
     صعوبة في أداء المهام متعددة المراحل
مثل تنظيف الأسنان وزر الملابس، وتسمى
بالابراكسيا الحركة.
     اتباع التعليمات خطوة بخطوة وسلسلة
طويلة من التعليمات وتسمى بالابراكسيا
الإنشائية.
ملحوظة: المهارة تحتاج أمرين (تنفيذ
وتخطيط):
     المشكلة في التنفيذ فقط: فهي أبراكسيا
ومرتبطة أكثر بالكلام.
     المشكلة بالتنفيذ والتخطيط معاً: فهي
ديسبراكسيا ومرتبطة بالحركة أكثر.
طرق التدخل والتأهيل المناسبة
للأبراكسيا:
يمكن تطوير قدرة الطفل على النطق
والكلام من خلال ثلاث مراحل مختلفة
باستخدام أدوات talk tools والتلميحات
الحسية:
المرحلة الأولى: إخراج الأصوات بأدوات
TALK TOOLS في هذه المرحلة، يتم استخدام
أدوات talk tools مثل الأشكال (المثلث،
المربع، الدائرة، الأنبوب ذات
المستويات المختلفة) وربط كل شكل بصوت
معين. بالإضافة إلى ذلك، يمكن استخدام
bite blocks بتدرجات مختلفة من 7:1 لتمكين
الفرد من تحسين الأصوات مثل “ممم”،
“بب”، “اه”، “او”، “ااااا”، “ي”،
“ايي”، و “هه”.
المرحلة الثانية: التلميحات الحسية
(TACTILE CUE) في هذه المرحلة، يتم استخدام
التلميحات الحسية كوسيلة للمساعدة.
وذلك من خلال الضغط على الأيدي بطريقة
معينة لتشجيع الطفل على تكرار الأصوات
أو الكلمات بشكل صحيح.
المرحلة الثالثة: سحب المساعدات في هذه
المرحلة، يتم سحب كل المساعدات التي تم
استخدامها في المراحل السابقة. حيث يكون
الطفل قادرًا على تقليد الأصوات أو
الكلمات بشكل صحيح بدون الحاجة إلى
المساعدات.
المنهج السابق يهدف إلى تنمية وتحسين
مهارات النطق والكلام عند الأطفال
الذين يعانون الأبراكسيا. وتتطلب هذه
العملية تدريبًا مستمرًا ومتواصلًا
لضمان تحقيق أقصى النجاح في تحسين
القدرات اللفظية.
أقرا ايضا: الأبراكسيا Apraxia | تعريف ،
أنواع ، أعراض ، أسباب ، علاج
ثانياً: الديسارثريا DYSARTHRIA:
الديسارثريا (Dysarthria) هي الاسم الشامل
لمجموعة أعطاب الكلام الناتجة عن خلل في
التحكم العصبي لآلية الكلام، وذلك بسبب
حدوث إصابة في الجهاز العصبي المركزي أو
الطرفي، وبالتالي فهي اضطراب من
اضطرابات الكلام يحدث خلل في النطق
نتيجة إصابة بالجهاز العصبي المركزي
وينتج عنها خلل في العمليات الأساسية
اللازمة للكلام والتي هي:
     إصدار الصوت Phonation
     النطق Articulation
     التنفس Respiration
     الرنين Resonance
     الإطار اللحني Prosody
أسباب الديسارثريا:
     إصابة المخيخ: المخيخ في جسم الإنسان
مسؤول عن الاتزان في الحركة الإرادية،
وعندما يتعرض لإصابة أو خلل، يمكن أن
ينتج عن ذلك ديسارثريا مسببة خللاً في
التحكم الحركي ومؤثراً على النطق
والكلام.
     إصابة العصبون المحرك الأعلى الصوت: في
بعض الحالات، يمكن أن يصبح العصبون
المحرك الذي يتحكم في حركات النطق
والصوت متوترًا بشدة أو مخنوقًا، مما
يؤدي إلى بطء معدل الكلام وعدم وضوح
السواكن، وانخفاض شدة الصوت.
     انخفاض حدة الصوت: الديسارثريا يمكن أن
تؤدي إلى انخفاض حدة الصوت، وفي بعض
الحالات، يتحدث المصاب بوتيرة واحدة.
     رنين زائد: يمكن أن ينتج رنين زائد في
الصوت نتيجة تشنج سقف الحلق.
     إصابة العصبون المحرك السفلي: يمكن أن
يتسبب هذا النوع من الإصابة في ما يعرف
الديسارثريا الرخوة، حيث تكون العضلات
ضعيفة وتؤثر على النطق.
     إصابات الجهاز الفوق هرمي: وظيفة هذا
الجهاز هي تنظيم الحركة، وأعطابه يمكن
أن تظهر في حالات مثل الشلل الرعاش.
بالفحص العصبي للمريض المصاب
بالديسارثريا، يمكن أن تظهر الأعراض
التالية:
     ضعف العضلات، مع ظهور حركات لا إرادية
عند محاولة الوصول إلى هدف معين، مثل
محاولة المريض الامساك بشيء أو رفع
فنجان من القهوة.
     اضطراب في توازن المريض أثناء المشي،
مما يجعله يترنح أثناء الحركة.
أنواع الديسارثريا:
الديسارثريا هي حالة متعددة الأشكال،
وتظهر بأنماط مختلفة تعتمد على العوامل
المسببة ومراكز الإصابة. وتتمثل
الأنماط المختلفة للديسارثريا فيما
يلي:
     الديسارثريا التشنجية: تشمل هذه
الحالة حالات الشلل التوافقي، حيث
يعاني المصاب من ضعف في العضلات أو ضمور
في العضلات. وتكون هناك زيادة في نغمة
الصوت وزيادة في رد الفعل الانعكاسي
والتوتر الزائد للعضلات.
     الديسارثريا الرخوة: تكون هذه الحالة
في جذع المخ وتصيب عضلات المضغ وتؤثر
على تعبيرات الوجه وبعض عضلات البلعوم
بالإضافة إلى عضلات الحنجرة واللسان.
وذلك يمكن أن يؤدي إلى سيلان اللعاب أو
انحراف اللسان للجانب المصاب وزيادة
الرنين في الأنف.
     الديسارثريا الرنحية: تظهر هذه الحالة
عادة في سن متأخرة بعد مرور 15 سنة، وتكون
غالبا وراثية. ومكان الإصابة يكون في
المخيخ وتصاحبها حركات لا إرادية،
خصوصا في الشفاه واللسان، ورعشة في
العين، والضغط على جميع المقاطع
الكلامية.
     الديسارثريا الفرط حركية: يكون اللسان
في هذه الحالة به حركات لا إرادية،
ويكون النطق غير صحيح، مع بحة في الصوت
وزيادة غير منتظمة في علو الصوت.
     الديسارثريا الهبط حركية (الشلل
الرعاش): في هذه الحالة، يكون الصوت
لاهثًا مع وجود مقاطع سريعة وغير واضحة
في الكلام، وأيضًا الكلام على وتيرة
واحدة.
     الديسارثريا المختلطة: تختلف الأعراض
في هذا النوع حسب مراكز الإصابة، وقد
تظهر نتيجة إصابات أو أعطاب معينة. يمكن
أن تكون متنوعة مثل الرخوة مع التشنجية
كما في حالات التصلب الجانبي الضموري
(ALS)، أو التشنجية مع الرنحية مع هبوط
حركية كما في مرض ويلسون “Wilson’s disease”،
أو التشنجية مع الرنحية كما في حالات
التصلب المتعدد “Multiple sclerosis”
.
طرق التدخل والتأهيل المناسبة
للديسارثريا:
طرق التدخل والتأهيل المناسبة
للديسارثريا تتضمن عدة مراحل وتقنيات
مهمة لتحسين النطق والصوت والتنغيم.
وتتمثل بعضاً من الطرق فيما يلي:
في البداية يجب أن يفهم المريض أننا
سنتعلم سويًا بعض الحركات التي كان
يؤديها بالفعل قبل الإصابة، كما يجب أن
يركز أثناء حديثه لاكتشاف الخطأ في
كلامه، كما يجب سرعة بدء الجلسات،
والأهتمام تمارين أعضاء النطق (Oral Motor)
حسب احتياج الحالة.
     التقييم الأولي وفهم الحالة: في
البداية، يجب على المعالج فهم حالة
المريض بشكل دقيق، والتعرف على
الصعوبات التي يواجهها في النطق
والكلام، وتحديد نقاط القوة والضعف
لديه.
     تدريبات التنفس: استخدام تدريبات
التنفس البطني (Smith Accent Method) ليتعلم
كيفية توظيف النفس في الكلام.
     تدريبات الصوت: باستخدام طريقة التنفس
البطني السابقة، ونطلب من المريض
الاستمرار في إصدار صوت (أ) حتى يستطيع
تحديد طبقة الصوت التي يثبت عليها، ثم
الانتقال لباقي الأصوات المتحركة، ثم
إلى كلمات مفردة، وكله حسب كل حالة.
     تدريبات النطق: إصدار المقطع الأول من
الكلمة منفصل ثم المقطع الذي يليه
وهكذا. مثال: “أح / مد”، “مح / مود” مع
الضغط على أول الكلمة، والمبالغة في
إصدار الأصوات الساكنة، وإطباق
الشفتين، مع تدريبات أعضاء النطق
والشفاه، والتشديد على الأصوات الوسطى
والأخيرة.
     تدريبات الرنين: تقوية عضلات الشفتين،
والفك، واللسان، وسقف الحلق، مع
تدريبات النطق، كما قد يتحسن الخنف
بالتوازي مع هذه التدريبات.
     تدريبات الإطار اللحني: نطلب من المريض
أن يبطئ في سرعة الكلام، وأن يتوقف بشكل
مناسب، وأن يضغط على بعض المقاطع
والكلمات، وكذلك تنغيمها بشكل مناسب.
     المرحلة النهائية: بعد التدريب المكثف
على الحركات والنطق والصوت والتنغيم
والتنفس، يتم سحب المساعدات، ومنح
المريض الفرصة لتقليد الأصوات والكلمات
بشكل صحيح بدون مساعدة.
هذه الخطوات تشكل جزءًا من خطة علاج
متكاملة لمساعدة الأفراد المصابين
بالديسارثريا على تحسين قدراتهم في
النطق والكلام.
ثالثاً: الفرق بين الأبراكسيا APRAXIA
والديسارثريا DYSARTHRIA:
الفرق بين الأبراكسيا والديسارثريا
يمكن تلخيصه على النحو التالي:
الأبراكسيا (APRAXIA):
     لا تنتج بسبب ضعف في العضلات، بل تنجم
عن اضطراب في عملية تخطيط الحركات
اللفظية.
     الأخطاء الكلامية غير ثابتة وقد تكون
متغيرة بين المرات المختلفة.
     من الصعب تحديد الأخطاء الكلامية بشكل
دقيق وتوقعها.
     يوجد رغبة ودافع للكلام، ولكن يتعذر
على الطفل تنفيذ الحركات اللفظية بشكل
صحيح.
     الجانب الاستقبالي (القدرة على فهم
اللغة والاستجابة لها) غالبًا ما يكون
جيدًا عند الأطفال المصابين بها.
الديسارثريا (DYSARTHRIA):
     تنتج بسبب ضعف في عضلات أعضاء النطق
مثل الشفاه واللسان والحنك.
     الأخطاء الكلامية ثابتة ومتكررة وقد
يكون من السهل توقعها.
     لا يوجد رغبة أو دافع للكلام، وذلك
بسبب صعوبة تنفيذ الحركات اللفظية بشكل
صحيح بسبب الضعف العضلي.
     الجانب الاستقبالي للغة يمكن أن يكون
جيدًا، ولكن الصعوبات تكمن في الإنتاج
اللفظي نتيجة ضعف العضلات.
بالإختصار، الأبراكسيا تعني صعوبة في
تخطيط وتنفيذ الحركات اللفظية بدقة دون
وجود ضعف عضلي، في حين أن الديسارثريا
تعني وجود ضعف عضلي يؤثر على النطق
ويسبب أخطاء كلامية ثابتة.
وبهذا نكون انتهينا من عرض اهم النقاط
الخاصة بالفرق بين الأبراكسيا
والديسارثريا."""
    },
    {
      "name":
          """الأفازيا الحبسة العي  الأفازيا (العي) Aphasia (العي) |تعريف ، أسباب ، أعراض ، أنواع ، علاج "
""",
      "text": """"تمثل الأفازيا (العي) تحدياً كبيراً
للأفراد المصابين بها، حيث تؤثر على
قدرة الفرد على فهم واستخدام اللغة
وبالتالي تؤثر على قدرتهم على التواصل
والتفاعل مع الآخرين وفي هذا المقال
نستعرض كافة المعلومات المتعلقة
بالأفازيا والتي هي كالتالي:
أضغط علي الجزء المراد القراءة عنه
للانتقال إليه
    ما هي الأفازيا (Aphasia) / العي؟
    أسباب
    أعراض
    أنواع 
    تأهيل وعلاج
ما هي الأفازيا (APHASIA) / العي؟
العي (أفازيا – Aphasia) هو اضطراب لغوي
يتسم بفقدان أو تضاؤل القدرة على
استخدام اللغة بشكل صحيح وفعال. ويكون
العي ناتجًا عن إصابة في أحد مراكز
النطق والكلام في المخ، ويؤثر على لغة
الفرد المنطوقة والمكتوبة بشقيها
الاسقبالي أو التعبيري أو كليهما.
أسباب الأفازيا (العي):
تحدث حالات العي أو الأفازيا بعد اكتمال
نمو اللغة عندما يتعرض مناطق الدماغ
المسؤولة عن إنتاج اللغة وفهمها للضرر
أو الإصابة. يمكن أن يكون هذا الضرر
ناتجًا عن العديد من الأسباب التي
نوضحها بعضها فيما يلي:
     أمراض الجهاز العصبي المركزي: مثل
السكتة الدماغية (الجلطات)، أورام المخ،
التصلب الجانبي الضموري (ALS)، والصرع،
والتصلب اللويحي.
     الإصابات الدماغية: قد تؤدي إصابات
الرأس الشديدة إلى تلف في مناطق الدماغ
المسؤولة عن التحكم في اللغة.
     الأمراض العصبية: بعض الأمراض العصبية
مثل مرض باركنسون ومرض الزهايمر قد تسبب
صعوبات في اللغة.
أعراض الأفازيا (العي):
المرضى المصابون بالأفازيا يتسمون بما
يلي:
1- الاستيعاب السمعي:
     لديهم ضعف واضح في استيعاب ما يسمعون.
     قد لا يفهمون الأوامر التي تطلب منهم،
وقد لا يعرفون تسمية الأشياء.
     يخلطون في معاني الكلمات المتشابهة.
2- الكلام:
     يجدون صعوبة في اختيار كلمات مناسبة
للمواقف.
     يلجأون إلى استبدال كلمة بأخرى.
     يعانون من صعوبة في التعبير عن أنفسهم.
3- القراءة:
     عدم القدرة على تمييز الكلمات
المكتوبة؛ يقرؤون الكلمات بدون فهم.
     لديهم بطء في القراءة وأخطاء فيها.
4- الكتابة:
     ينسون شكل الحروف.
     يكتبون كتابة عكسية.
     يحذفون ويستبدلون بعض الحروف.
     لديهم أخطاء في الكتابة الإملائية.
     يكتبون ببطء شديد.
5- الإشارات:
     لديهم عجز في التواصل عن طريق
الإشارات.
     لا يفهمون المقصود بالإشارات.
 
أنواع الأفازيا (العي):
تختلف الأنواع بطقاً لحجم وموقع
الإصابة في المخ:
1- الأفازيا التعبيرية أو الحركية
(أفازيا بروكا):
الأفازيا التعبيرية أو الحركية، والتي
تُعرف أيضًا بأفازيا بروكا أو أفازيا
بروكا الحركية Aphamia. وتتميز بعجز الشخص
المصاب عن التحدث بشكل صحيح، حيث يكتفي
عادة بتكرار كلمة واحدة، بغض النظر عن
المحادثات التي يجريها. وفي حالات
الانفعال، يمكن أن يتمم المصاب ببعض
العبارات غير المفهومة، وذلك للتعبير
عن مشاعره أو ردود فعله.
يتسم المصاب بهذا النوع بعدم القدرة على
الكلام على الرغم من وجود الكلمات في
ذهنه. فيفقد المصاب القدرة على التعبير
باستثناء استخدام كلمات بسيطة مثل
“نعم” أو “لا”. وتحدث هذه الحالة
نتيجة لإصابة المناطق الأمامية في نصف
المخ الأيسر، وتحديدًا في منطقة 44
المعروفة باسم منطقة بروكا. حيث تقع هذه
المنطقة أمام منطقة الحركة الأولية
المسؤولة عن إخراج الكلام.
تجد المصاب بالأفازيا التعبيرية يتحدث
بشكل قليل للغاية، وعندما يتحدث، يكون
كلامه مقيدًا وغالبًا ما يكون بسيطًا
جدًا، ويفتقر إلى الأجزاء النحوية
وتصريف الأفعال. هذا ما يُشار إليه بـ
“كلام تلغرافي”. كما يعاني المصابون
بهذا النوع من صعوبة في التعبير سواء
كان ذلك في اللغة المنطوقة أو المكتوبة،
والمشكلة تكمن في الإنتاج الحركي من
مراكز المخ للغة وليس في الفهم.
2- الأفازيا الاستقبالية أو الحسية
(أفازيا فيرنيك):
الأفازيا الاستقبالية أو الحسية،
والمعروفة أيضًا باسم أفازيا فيرنيك.
تحدث عندما يتعرض جزء من الدماغ الواقع
وراء شق سيلفيوس للضرر أو الإصابة. هذا
الضرر يؤدي إلى تلف الخلايا العصبية
التي تسهم في تشكيل الصور السمعية
للكلمات والأصوات.
تعرف هذه الحالة أحيانًا باسم “بالصمم
الكلامي” حيث يظل الاستقبال السمعي
سليمًا لدي الفرد ولكن الألفاظ تفقد
معناها بالنسبة للشخص المصاب. فالمصاب
بهذا النوع غالبًا لا يمكنه فهم الكلام
بشكل عام.
يمكن أن يكون الكلام للمصاب بالأفازيا
الاستقبالية أكثر طلاقة من المصاب
بالأفازيا التعبيرية، ولكن ذلك يعتمد
على حجم ومدى الإصابة. يُلاحظ في
الأفازيا الحسية (فرنيك) أن المصاب قادر
على فهم كل لفظ في الجملة بشكل منفصل
ولكنه غالبًا لا يمكنه فهم المعنى،
ولهذا السبب يُطلق عليها أحيانًا اسم
الأفازيا المعنوية.
3- الأفازيا تسمية الأشياء (الأفازيا
النسيانية):
أفازيا تسمية الأشياء، المعروفة أيضًا
بالأفازيا النسيانية. تظهر في صعوبة
تسمية الأشياء، حيث يشير المصاب إلى
استخدام الأشياء نفسها بدلاً من
تسميتها.
وهذا النوع لا يشمل نسيان اسماء الأشياء
المادية فقط بل يمتد أيضًا إلى الأشياء
المسموعة والملموسة. فالمصاب غالبًا ما
يتذكر الحروف وأجزاء الكلمات بشكل
طبيعي ويكون قادرًا على استخدام الشيء
والإشارة إليه إذا سمع اسمه أو رآه،
ولكن يعاني من مشكلة في تسميته.
وعلى الرغم من وجود هذه الصعوبة لدى
المصابين بمعظم الأنواع الأخرى، إلا أن
الصورة الأوضح لأفازيا تسمية الأشياء
تنشأ نتيجة إصابة منطقة قشرية تقع في
الفص الصدغي والفص الجداري. يعتقد
الباحثون أن هذا النوع يحدث نتيجة
انقطاع التواصل بين القنوات الحسية
التي تعتبر جزءًا داخليًا من قدرة الفرد
على تسمية الأشياء.
4- الأفازيا التوصيلية:
الأفازيا التوصيلية هي حالة تتسم بعدم
قدرة المصاب على إعادة ما يسمعه بصوت
عالٍ. الكلام الذي ينطقه الشخص المصاب
في هذه الحالة ماهو الا رطانه لا معني
لها، ويكون مجرد تسلسل عشوائي من
الكلمات. على عكس أفازيا فرنيك ، فإن
المصاب هنا قادر على فهم الكلام المنطوق
والمكتوب بشكل جيد إلى حد ما. تحدث هذه
الحالة نتيجة فصل مراكز الاستقبال
اللغوي عن مراكز التعبير في الدماغ.
5- الأفازيا الشاملة أو الكلية:
الأفازيا الشاملة أو الكلية. يتسم
المصاب بعجز شديد في جميع جوانب اللغة.
حيث يتعذر على الشخص المصاب فهم الكلام
وإنتاجه، فيظهر الكلام بشكل معيب أو لا
يظهر تمامًا. ويكون التواصل مع الآخرين
ممكنًا عادةً من خلال الإشارات
والرموز، وقد يلجأ المصاب إلى استخدام
الصور بدلاً من استخدام الكلام.
ينجم هذا النوع عن إصابة واسعة في نصف
المخ الأيسر، حيث تشمل العديد من
المناطق المختلفة التي تؤثر على القدرة
على فهم وإنتاج اللغة. يمكن أن ينجم هذا
النوع من الأفازيا عن حدوث جلطة دموية
تؤدي إلى انسداد الأوعية والشرايين
الدموية التي تغذي المخ. كما يمكن أن
يكون سببًا لهذه الأعراض الالتهابات
والنزيف الدماغي الذي يؤدي إلى نقص في
التغذية والأكسجين اللازمين.
6- الأفازيا الممتدة:
الأفازيا الممتدة، المعروفة أيضًا
بالعابرة لمناطق القشرة، تحدث نتيجة
إصابة منطقة في القشرة الدماغية، ولكن
هذه الإصابات تحتفظ بمراكز الكلام
والمسارات الموصلة بينهما. وتعمل هذه
الإصابات على عزل المراكز والمناطق
المتضررة عن باقي المخ. إذا تم عزل منطقة
فرنيك عن باقي أجزاء المخ، نعتبر ذلك
النوع كـ”الأفازيا الحسية المعزولة”.
وإذا تم عزل منطقة بروكا في القشرة
الدماغية، نعتبر ذلك النوع كـ
“الأفازيا المختلطة الممتدة”.
تأهيل وعلاج الأفازيا:
علاج الأفازيا (Aphasia) يشمل مجموعة من
الإجراءات والتقنيات التي تهدف إلى
تحسين قدرة الشخص على التواصل واستعادة
قدراته اللغوية المفقودة. وتتمثل بعض
خطوات العلاج في الآتي:
     العلاج اللغوي: يشمل هذا العلاج تدريب
الشخص على تحسين مهاراته في اللغة
والنطق. واستعادة أقصى قدر من المهارات
اللغوية المفقودة.
     التدريب على التواصل البديل: في بعض
الحالات، يمكن تعليم الشخص تقنيات
التواصل البديل مثل الإيماءات أو
استخدام الأجهزة المساعدة لتعزيز
التواصل.
     العلاج المعرفي السلوكي: يمكن أن يكون
العلاج السلوكي المعرفي مفيدًا في
تغيير الأفكار والآثار السلبية الناتجة
عنها وزيادة التوافق النفسي.
يجب أن يكون العلاج مخصصًا لاحتياجات كل
فرد ويجب تقديمه من قبل أخصائيي النطق
واللغة المؤهلين. العلاج يمكن أن يستمر
لفترة طويلة ويتطلب التفرغ والصبر،
ولكن مع التدريب والتمارين المناسبة،
يمكن للأشخاص الذين يعانون من الأفازيا
تحقيق تحسن كبير في قدرتهم على التحدث
بسلاسة."""
    },
    {
      "name": "عشر نصائح لعلاج التأتأة(التلعثم) عند الاطفال",
      "text": """علاج التأتأة عند الأطفال ليس صعبًا على
الإطلاق، فمن خلال فهم طبيعة المشكلة
وتأثيرها على الطفل يمكن تقليل شدتها.
يعد اضطراب التلعثم من الاضطرابات
الشائعة عند الاطفال والذي يؤدي إلى ضعف
قدرة الطفل على التحدث بطلاقة، ويرتبط
التلعثم (التأتأة) ارتباطاً وثيقاً
بالشعور بالتوتر أو القلق، وتتوقف شدة
التلعثم عند الأطفال علي الأسلوب
والطريقة التي يتعامل بها الأهل
والاشخاص المحيطين مع الطفل، ومدى
إدراك الطفل لمشكلته.
فكلما تعامل الأهل بطريقة صحيحة مع
الطفل، كلما قلت شدة التلعثم عنده.
كذلك، كلما قل إحساس وإدراك الطفل
بمشكلته، كلما قلت شدة التلعثم لديه.
نصائح تقليل التلعثم وعلاج التأتأة عند
الاطفال
فيما يلي، أهم النصائح والإرشادات التي
تساعد علي تقليل حدوث التعلثم وعلاج
التأتأة عند الاطفال:
1- استمع لكلام طفلك بأهتمام:
استمع لكلام ابنك بأهتمام، عندما يتحدث
طفلك إليك، ألتفت إليه وأنظر له بحب
وأظهر له اهتمامك بكلامه ورغبتك في
الاستماع له.
2- اترك مساحة جيدة لابنك للكلام:
استمع لطفلك بصبر، ودعه ينهي كلامه
براحة وهدوء، ولا تقاطعه أثناء الكلام.
احترم وجهات نظره ودعه يعبر عن أفكاره
ومشاعره بحرية.
3- تقبل مشكلة الطفل:
تقبل مشكلة ابنك، وشجعه علي تقبل مشكلته
وعدم الشعور بالقلق والاحباط. علم الطفل
أن كل انسان لديه مشكلة، وليس عيباً أن
تكون لديه مشكلة حتي وأن كانت في
الكلام، وأن التلعثم مشكلة يمكنه
التغلب عليها بالاصرار والمحاولة
والثقة بالنفس.
4- لا تلوم الطفل علي مشكلته:
لا تلوم الطفل علي مشكلته، ولا تعلق علي
التلعثم لديه باستمرار كأن تقول له أن
يتكلم جيداً، أو توبخه علي طريقة كلامه
أو تهدده بالعقاب اذا لم يتكلم بشكل جيد.
5- تجنب التركيز على المشكلة:
لا تلفت نظر الطفل لمشكلته، فكلما لفت
نظره للمشكلة، كلما شعر الطفل بأنه
يتكلم بطريقة غير عادية، وبالتالي تقل
ثقته بنفسه، وهذا ما قد يشعره بالتوتر
والقلق اثناء كلامه مع الأخرين،
وبالتالي زيادة حدوث التأتأة.
 
6- عدم التهكم او السخرية من طريقة كلام
الطفل:
لا تضحك علي مشكلة الطفل، ولا تجعل أحد
يضحك علي أسلوب كلامه أو يتنمر عليه.
فهذا يؤثر علي ثقته بنفسه، ويلفت نظره
بشدة إلي وجود مشكلة كبيرة لديه في
الكلام، وبالتالي تزداد لديه شدة
التلعثم (التأتأة).
7- لا تبالغ في التعاطف تجاه الطفل:
لا تظهر قدراً مبالغاً فيه من التعاطف
تجاه مشكلة الطفل. فهذا قد يزيد من شعور
الطفل بمشكلته، ويضعف من ثقته بنفسه،
وقد يؤدي إلي حدوث التلعثم بكثرة فيما
بعد.
8- تكلم مع الطفل في الوقت المناسب:
تكلم مع ابنك بكثرة في الأيام التي يقل
فيها حدوث التأتأة، وذلك حتى تزيد من
ثقة الطفل بنفسه وثقته في طريقة كلامه.
ولا تتكلم معه كثيراً في الايام التي
تزيد فيها التأتأة، وذلك حتى لا يشعر
بعدم الثقة في نفسه وفي كلامه.
9- تشجيع الطفل وبناء ثقته بنفسه:
قم بتشجيع طفلك بشكل مستمر وتحفيزه
للتحدث بثقة وبجهد. كن إيجابياً في
التعامل معه، وأشد بجهوده في التغلب على
التلعثم. كذلك قدم له الدعم والثناء
عندما ينطق الكلمات بوضوح وطلاقة. إن
بناء ثقة الطفل بنفسه يساعده على التحدث
بثقة ويقلل من حدوث التلعثم بشكل
تدريجي.
أقرأ ايضاً : 10 نصائح لزيادة الثقة
بالنفس عند الأطفال
10- توفير جو أسري ملائم وخالٍ من
المشاكل:
حافظ على جو أسري إيجابي وملائم لطفلك،
وحاول تجنب المشاكل الأسرية أمامه. قد
يؤثر الجو العائلي الإيجابي على نمو ثقة
الطفل بنفسه وإحساسه بالسعادة بشكل عام.
حاول حل المشكلات الأسرية بطرق بناءة
وبدون إقحام الأطفال بها. وتجنب
المشاجرات والنقاشات العنيفة أمام
الأطفال، فالأطفال تحتاج إلي بيئة أمنة
ومستقرة حتي يشعروا بالراحة والأمان.
وأخيراً، لابد من التوجه إلي أخصائي
تخاطب. فالتدريب الممنهج الذي تقدمه
جلسات التخاطب يلعب الدور الرئيسي
والأساسي في تقليل شدة التلعثم وعلاج
التأتاة عند الاطفال. وبذلك فإنه لا غنى
عن جلسات التخاطب في حالة كون مشكلة
التلعثم شديدة عند الطفل.
وبهذا نكون أنهينا اهم النصائح التي
تساعد علي تقليل التلعثم وعلاج التأتأة
عند الاطفال."""
    },
    {
      "name": " العلاقة بين التكامل الحسي والاتجاه المعرفي للغة",
      "text": """ما هي مهارات ما قبل اللغة؟
مهارات ما قبل اللغة هي مجموعة المهارات
الأساسية التي يطورها الأطفال قبل أن
يتعلموا اللغة والكلام (عادة قبل نطق
الكلمة الأولى لهم). وتلك المهارات تشكل
أساساً هاماً لتعلم اللغة والكلام
والتواصل الفعال فيما بعد، فهي التي
تساعدهم علي تعلم واكتساب اللغة
والكلام من الأخرين وممارسته بتلقائية
وطلاقة. وفي حالة حدوث قصور فيها قد تؤدي
إلي معوقات في تعلم الأطفال النطق
والكلام.
لمهارات ما قبل اللغة دوراً هاماً في
تعلم الأطفال الكلام عموماً. كذلك يلعب
التدريب عليها دوراً هاماً مع الاطفال
التي تعاني من اضطرابات ومشكلات مثل:
أطفال تأخر اللغة وأطفال التوحد
والعديد من المشكلات الأخرى. فيعد
تدريبهم علي مهارات ما قبل اللغة أمراً
هاماً وضرورياً حتي يتمكن الطفل من تعلم
وممارسة الكلام بسهولة وتلقائية.
مكونات مهارات ما قبل اللغة
في هذا المقال سنناقش مهارات ما قبل
اللغة من منظورى الشخصى ومن منظور
تدريبي وليس نمائي، وكذلك بقدر كبير من
التفصيل حتي تفهمها جيداً. وسنركز علي
المهارات التي تحتاج إلي أن تقوم بتقييم
الطفل فيها، ومعرفة مستواه بها، واذا
كان يعاني من قصور فيها ، وذلك لتدريب
الطفل عليها لمساعدته علي الكلام.
ملحوظة: يمكنك الانتقال إلي أخر الصفحة
لمشاهدة ملخص المقال في فيديو لشرح
مهارات ما قبل اللغة.
وتتكون مهارات ما قبل اللغة من العديد
من المهارات والتي تتمثل في الآتي:
 مهارات ما قبل اللغة مهارات ما قبل
اللغة
1- الانتباه البصري:
ويقصد بالانتباه البصري هو احساس الطفل
بوجود مثير بصري (شئ معين) حوله والنظر
له. فاذا قمت بتشغيل الكشاف في غرفة
مظلمة مثلاً ، فأن الضوء يجذب انتباه
الطفل بحيث يلتفت إلي مصدر الضوء كأن
ينظر إلي ضوء الكشاف علي الحائط ، وقد
يعاني بعض الاطفال من مشكلة ضعف
الانتباه البصري لديهم بحيث لا ينجذب
الانتباه البصري لديهم إلي الاشياء من
حولهم بسهولة. وتدريب الاطفال علي
الحضور والانتباه البصري أمراً هاماً
فهو يعد المرحلة الأولي لعملية استقبال
اي شئ يراه الطفل ومن ثم فهمه وتخزينه.
بالتالي قد تحتاج إلي تقييم الطفل
وتدريبه علي الحضور والانتباه البصرى
كخطوة أولى.
2- الانتباه السمعي:
ويقصد بالانتباه السمعي هو احساس الطفل
بوجود مثير سمعي (صوت معين) حوله
والالتفات له. فاذا قمت بعمل صوت مثل طرق
ملعقة علي كوب مياه مثلاً ، فأن الصوت
يجذب انتباه الطفل بحيث يلتفت إلي مصدر
الصوت وينظر إلي الملعقة او الكوب. وقد
يعاني بعض الاطفال من مشكلة ضعف
الانتباه السمعي بحيث لا ينجذب إلي
الأصوات التي تحدث من حوله بسهولة ،
وبالتالي فان تدريب الاطفال علي الحضور
والانتباه السمعي أمراً هاماً فهو يعد
المرحلة الأولي لعملية الاستقبال اي شئ
يسمعه الطفل ومن ثم فهمه وتخزينه.
بالتالي قد تحتاج إلي تقييم الطفل
وتدريبه علي الحضور والانتباه السمعي
كخطوة أولى.
3- التركيز البصري:
هناك فارق بين الانتباه والتركيز ،
فالانتباه البصري يقتصر علي مجرد النظر
لمصدر الضوء كالمثال السابق ، اما يقصد
بالتركيز البصري هو استمرار النظر إلي
مصدر الضوء لمدة معينة. ويساعد هذا
الأمر علي النظر إلي المثيرات البصرية
(الاشياء) لمدة أطول وبالتالي استقبالها
الاشياء التي يراها وفهمها وتخزينها
بشكل أفضل. فأعلم انه قد تحتاج إلي تقييم
الطفل وتدريبه علي زيادة مدة التركيز
البصري.
4- التركيز السمعى:
كما ذكرنا فهناك فارق بين الانتباه
والتركيز ، فالانتباه السمعي يقتصر علي
مجرد الاحساس بمصدر الصوت والالتفات له
كالمثال السابق. اما تركيز الانتباه
السمعي فمعناه استمرار تركيز الطفل علي
مصدر الصوت والاستماع له لمدة معينة.
ويساعد هذا الأمر علي الاستماع إلي
المثيرات السمعية (الأصوات أو كلام
الأخرين) لمدة أطول وبالتالي استقبال
المعلومات التي يسمعها وفهمها وتخزينها
بشكل أفضل. فأعلم انه قد تحتاج إلي تقييم
الطفل وتدريبه علي زيادة مدة التركيز
السمعي.
أقرا ايضاً : بالصور 20 نشاط لزيادة
الانتباه والتركيز عند الاطفال
5- الإدراك البصري:
يقصد بالإدراك البصري هو تفسير
المثيرات (الاشياء) التي يراها الطفل
ومعرفة خصائصها من حيث الشكل والتمييز
فيما بينها. ويلعب تدريب الاطفال علي
بعض مهارات الإدراك البصري مثل: التطابق
بين المجسمات والصور علي تنمية جانب
الادراك البصري بالقدر الذي يساعده علي
التمييز بين الاشياء التي قد تتشابه في
الشكل أو اللون ، وبالتالي عدم الخلط
بين اسماء الاشياء (مثل طماطم وتفاحة)
عند تعليمه لها نظراً لتشابههم في
اللون. كما يساعده علي تعميم مفهوم
الاشياء بسهولة ، فقم بتقييم الطفل في
مهارة التطابق فقد تحتاج إلي تدريبه
عليها.
6- الادراك السمعي:
يقصد بالإدراك السمعي هو تفسير
المثيرات (الأصوات) التي يسمعها الطفل
وفهمها والتمييز فيما بينها. وقد يظهر
علي الطفل مدي ادراكه وتمييزه للأصوات
التي يسمعها في تمييزه صوت أمه عن أبيه
مثلاً ، ويساعد تدريب الطفل علي فهم
كلمة (لا) وتنفيذ الأوامر البسيطة علي
زيادة وعي وفهم الطفل للأصوات التي
يسمعها من الأخرين وان كلام الاخرين ذو
معني وهي تعد الخطوة الأولى في اللغة
الاستقبالية لديه.
 
7- الانتباه المشترك:
ويقصد بالانتباه المشترك هو أن يقوم
الطفل بتركيز انتباهه مع شخص أخر علي شئ
معين. فمثلا عندما تقوم بتحريك لعبة
للامام والخلف ، يقوم الطفل بالنظر معك
إلي اللعبة وتركيز انتباهه عليها. وذلك
يساعد الطفل فيما بعد علي فهم واستيعاب
الكلمات التي تحاول تعليمه لها. فعندما
تقوم بتعليمه كلمة تفاحة مثلاً ، سيقوم
الطفل بمشاركة الانتباه معك في النظر
إلي التفاحة والتركيز علي شكلها
والاستماع لاسمها وبالتالي تخزينها
ونطقها فيما بعد. عليك بتقييم الطفل في
جانب الانتباه المشترك ووضع الأهداف
التدريبية المناسبة له.
8- التواصل البصري:
يقصد بالتواصل البصري هو نظر الطفل لك
في عينك لمدة معينة. ويساعد التواصل
البصري علي تحسين عملية التواصل ككل،
وتحسين عملية اكتساب الكلمات، وتعلم
الكلام من الأخرين وتحسين النطق، حيث
انه يساعد الطفل علي تركيز الانتباه علي
وجه المتحدث، وتوجيه التركيز له،
وملاحظته جيداً اثناء النطق، والاستماع
له بشكل جيد، وكذلك ملاحظة حركات الفم
والشفاة، ومعرفة كيف تنطق الكلمة،
وبالتالي سهولة تقليد نطقها فيما بعد.
فاذا يعاني الطفل من قصور في التواصل
البصري ، لابد من تدريبه علي زيادة مدة
التواصل البصري.
9- التقليد:
يلعب التقليد (التعلم بالملاحظة
والمحاكاة) دوراً هاماً في تعليم
الأطفال الكثير من الأشياء بما فيها
اللغة والكلام. ويتم ذلك عن طريق ملاحظة
الطفل شخص أكبر منه اثناء قيامه بسلوك
معين وتقليد ذلك السلوك. ويلعب التقليد
دوراً هاماً في اكتساب الاطفال اللغة عن
طريق ملاحظة كلام الكبار وطريقه نطقه
وتقليده مرة أخرى. ويتدرج تدريب الأطفال
علي التقليد اذا وجدت صعوبة لديهم به ،
فقد تحتاج إلي تقييم الطفل في جوانب
التقليد المختلفة من تقليد حركات كبري،
وحركات صغرى، وحركات الشفاة وللسان،
والتقليد الصوتي لأصوات الحيوانات
والمقاطع (با تا)، وترديد الكلمات،
وتدريبه علي جوانب القصور به.
10- الطلب بالإشارة:
ويقصد به ان يشير الطفل إلي الشئ الذي
يريده محاولة منه للحصول عليه. ويساعد
تدريب الطفل علي الطلب من خلال الإشارة
إلي تنمية القدرة لديه علي الطلب
بالأصوات والكلمات والجمل فيما بعد،
وبالتالي تنمية الجانب التعبيري لديه.
عليك تقييم الطفل في الطلب بالإشارة
وتدريب الطفل علي الطلب اذا عاني من
قصور به.
أقرا ايضاً : تأخر اللغة والكلام | تعريف
، أعراض ، أسباب ، علاج
توصيات تخص مهارات ما قبل اللغة
قد تزيد مهارات ما قبل اللغة عما ذكرت.
وقد يصنفها البعض بطرق وأساليب أخرى
وينقص منها نقاط او يزيد عليها نقاط.
ولكنني حاولت جمع كافة النقاط الأساسية
من منظوري، والتي من شأنها مساعدة
الاطفال التي لا تنطق اي كلمات بعد
تدريبهم علي كافة المهارات المذكورة
كلها علي البدأ في معرفة وتمييز ونطق
كلماتهم الأولى، وبدون أي معوقات ترجع
إلي غياب أحد المهارات الهامة لديهم.
ويساعد فهمك للنقاط الخاصة بمهارات ما
قبل اللغة والتي قمت بشرحها مسبقاً علي
إدراك المشكلة التي قد يعاني منها الطفل
في أحدى تلك المهارات ومدى تأثيرها علي
تعلم اللغة لديه. واذا اكتشفت قصور في
أحدى هذا المهارات ، فليس عليك بعدها
سوء أن تقوم بوضع الانشطة التي تساعدك
علي تأهيل الطفل في كل مهارة من
المهارات التي يعاني من قصور بها. وذلك
حتي تبني لديه أساساً قوياً يستطيع من
خلاله تعلم كلماته الأولى بسهولة ويسر
وتلقائية دون جهد كبير ومحاولات يائسة
كثيرة.
ولا تنسى الاهتمام بجانب التواصل
والتفاعل الاجتماعي خاصة مع أطفال
التوحد ، فهو يلعب دوراً هاماً بجانب
المهارات التي سبق ذكرها.
"""
    },
    {
      "name": "طرق خفض الرهاب الاجتماعي المصاحب للتلعثم ",
      "text": """التلعثم من الاضطرابات التي قد تصيب
الأطفال أو المراهقين أو الراشدين ،
ولابد من إمتلاك الوالدين أو المريض
الوعي الكافي للتعامل مع ذلك الاضطراب
وتقبله، لكي يتم التأهيل بشكل جيد
ومناسب.
يؤثر التلعثم علي العلاقات الاجتماعية،
وقد يصيب الفرد بالقلق الاجتماعي Social
Phobia الذي قد يدفعه إلي العزلة والوحدة،
وتجنب الكثير من المواقف الاجتماعية،
وظهور سلوكيات غير مرغوبة، وقد يظهر
اضطرابات نفسية مصاحبة.
وبهذا المقال نناقش الرهاب الاجتماعي
وعلاقته بالتلعثم، وكيف يمكن مواجهة
كلاهما والخفض من شدتهم، وذلك في النقاط
الرئيسية التالية:
     ماهو الرهاب الاجتماعي
     أعراض الرهاب الاجتماعي
     كيفية الخفض من الرهاب الاجتماعي
المصاحب للتلعثم
ماهو الرهاب الاجتماعي؟
هو أحد الاضطرابات النفسية الخطيرة ،
حيث توثر علي توافق الفرد وتكيفه مع
البيئة التي يعيش فيها. وهو اضطراب لا
يرتبط بعمر معين ويظهر في أي سن ويتضح
أكثر في سن المراهقة.
أعراض الرهاب الاجتماعي:
الرهاب الاجتماعي هو اضطراب نفسي يتسم
بالخوف والقلق المفرطين في المواقف
الاجتماعية، حيث يخشى الشخص المصاب من
أن يتعرض للإحراج أو يكون محور انتباه
الآخرين. وتشتمل الأعراض علي الاتي:
الأعراض الاجتماعية:
     تجنب الأحداث الاجتماعية.
     رفض التحدث في المواقف الاجتماعية.
     الخوف الشديد من التعامل مع الغرباء.
     تجنب المواقف التى قد يكون فيها محور
الاهتمام.
     تجنب فعل اي شي للاخرين.
الأعراض الجسدية:
     احمرار الوجنتين.
     تسارع ضربات القلب.
     الارتجاف.
     التعرق الشديد.
     اضطرابات المعدة أو الغثيان.
     الدوخة.
     صعوبة في التنفس.
     توتر عضلي.
     تجنب التواصل البصري.
التلعثم قد يصبح عقبة تؤثر في تعامل
الفرد مع الآخرين وتسببه له الأعراض
السابقة، مما يعيقه عن التعامل مع
الأخرين من حوله بفاعلية. وقد يسبب له
نوعاً من العزلة الاجتماعية المتمثلة
في تجنبه للمواقف الاجتماعية خوفاً من
التعرض للتنمر بأشكاله المتعددة كالنقد
أو السخرية.
 
كيفية الخفض من الرهاب الاجتماعي
المصاحب للتلعثم
يساعد العلاج بجلسات التخاطب من خلال
أخصائي التخاطب، والارشاد النفسي من
خلال الأخصائي النفسي كلاهما علي الخفض
من شدة كلا الاضطرابين، خاصة اضطراب
التلعثم والذي يعد سبباً للرهاب
الاجتماعي، فعن طريق علاج السبب تختفي
النتائج المترتبة عليه. بالتالي هنالك
العديد من الخطوات التي يجب ادراكها
والسعى إلي تحقيقها من خلال الأخصائيين
السابق ذكرهم بالتعاون مع الأهل، وهم
كالآتي:
     فهم طبيعة التلعثم والتثقيف
بالمعلومات المرتبطة به.
     تقبل المشكلة والتوجه إلي السعي
للحلول المناسبة.
     مراعاة الاهتمام والصبر اثناء فترة
التأهيل والانتظام علي الجلسات.
     التعاون مع أخصائي التخاطب من أجل
الاسراع في خفض حدة اضطراب التلعثم.
     تشجيع الطفل ورفع معنوياته عن طريق سرد
قصص لشخصيات مؤثرة مرت بمشكلة التلعثم.
     وقاية الطفل من التنمر عن طريق تعليمه
كيفية مواجهة تلك المواقف.
     اتباع الارشادت الخاصة بالتلعثم والتي
تساعد علي التخفيف من الضغوطات
الخارجية التي تؤثر علي الطفل وتزيد من
شدته وهي: نصائح لعلاج التأتأة عند
الاطفال
الاهتمام بالعلاج المعرفي السلوكي
لعلاج التعلثم:
العلاج المعرفي-السلوكي (Cognitive Behavioral
Therapy – CBT) هو نهج علاجي فعال يستخدم
لعلاج مجموعة متنوعة من الاضطرابات
والمشاكل النفسية والسلوكية، بما في
ذلك التعلثم. يجب الاهتمام بالعلاج
المعرفي-السلوكي لخفض الرهاب الاجتماعي
اذا صاحب للتعلثم ويقوم ذلك النوع من
العلاج علي العديد من النقاط التي هي
كالآتي:
     التعاون والمشاركة الفعالة مع المريض
واقامة جو ارشادي جيد.
     حث الفرد علي التعبير عن الأفكار
الخاطئة التي لديه عن طبيعة اضطراب
التلعثم ونظره الناس له.
     تشجيع الفرد علي تصحيح اخطاء التفكير
لديه وتحويلها إلي أفكار أكثر ايجابية.
     تعديل الاستجابات الانفعالية التي هي
مصدر الكرب المباشر الذي يعاني منه
الشخص.
     توجيه الفرد إلي تركيز تفكيره
واهتمامه علي الحاضر وليس الماضي ما حدث
به.
     تشجيع المريض علي تفهم حالته وان يكون
معالج نفسه.
أساليب العلاج المعرفي السلوكي :
     إعادة بناء الأفكار
     فنية لعب الأدوار
     استراتيجيه التعزيز
لكي يتم التدخل بشكل فعال لابد من:
     تحديد المرحلة العمرية.
     معرفه خصائص تلك المرحلة العمرية
والتعامل مع الفرد في ضوئها.
     تحديد المشكلة وشدتها بشكل دقيق.
أخيرا، لابد من التعاون من قبل الحالة
والاهل والاخصائي والتحلي بالصبر حتي
نصل إلي نتيجة ملحوظة وفعالة في الخفض
من اضطراب التلعثم لدي الفرد وكذلك
زيادة تقبله له. هكذا نستطيع الخفض من
حدة الرهاب الاجتماعي المصاحب للتلعثم،
ونصل بالحالة إلي أن يستطيع التعايش
ومواجهة المجتمع، والتعامل مع مواقف
الاجتماعية بأشكالها المختلفة. ومن ثم
يقوم بدوره الاجتماعية بشكل فعال.
"""
    },
    {
      "name":
          "مهارات ما قبل اللغة | مفتاح النطق والكلام لأطفال تأخر اللغة والتوحد",
      "text": """ما هي مهارات ما قبل اللغة؟
مهارات ما قبل اللغة هي مجموعة المهارات
الأساسية التي يطورها الأطفال قبل أن
يتعلموا اللغة والكلام (عادة قبل نطق
الكلمة الأولى لهم). وتلك المهارات تشكل
أساساً هاماً لتعلم اللغة والكلام
والتواصل الفعال فيما بعد، فهي التي
تساعدهم علي تعلم واكتساب اللغة
والكلام من الأخرين وممارسته بتلقائية
وطلاقة. وفي حالة حدوث قصور فيها قد تؤدي
إلي معوقات في تعلم الأطفال النطق
والكلام.
لمهارات ما قبل اللغة دوراً هاماً في
تعلم الأطفال الكلام عموماً. كذلك يلعب
التدريب عليها دوراً هاماً مع الاطفال
التي تعاني من اضطرابات ومشكلات مثل:
أطفال تأخر اللغة وأطفال التوحد
والعديد من المشكلات الأخرى. فيعد
تدريبهم علي مهارات ما قبل اللغة أمراً
هاماً وضرورياً حتي يتمكن الطفل من تعلم
وممارسة الكلام بسهولة وتلقائية.
مكونات مهارات ما قبل اللغة
في هذا المقال سنناقش مهارات ما قبل
اللغة من منظورى الشخصى ومن منظور
تدريبي وليس نمائي، وكذلك بقدر كبير من
التفصيل حتي تفهمها جيداً. وسنركز علي
المهارات التي تحتاج إلي أن تقوم بتقييم
الطفل فيها، ومعرفة مستواه بها، واذا
كان يعاني من قصور فيها ، وذلك لتدريب
الطفل عليها لمساعدته علي الكلام.
ملحوظة: يمكنك الانتقال إلي أخر الصفحة
لمشاهدة ملخص المقال في فيديو لشرح
مهارات ما قبل اللغة.
وتتكون مهارات ما قبل اللغة من العديد
من المهارات والتي تتمثل في الآتي:
 مهارات ما قبل اللغة مهارات ما قبل
اللغة
1- الانتباه البصري:
ويقصد بالانتباه البصري هو احساس الطفل
بوجود مثير بصري (شئ معين) حوله والنظر
له. فاذا قمت بتشغيل الكشاف في غرفة
مظلمة مثلاً ، فأن الضوء يجذب انتباه
الطفل بحيث يلتفت إلي مصدر الضوء كأن
ينظر إلي ضوء الكشاف علي الحائط ، وقد
يعاني بعض الاطفال من مشكلة ضعف
الانتباه البصري لديهم بحيث لا ينجذب
الانتباه البصري لديهم إلي الاشياء من
حولهم بسهولة. وتدريب الاطفال علي
الحضور والانتباه البصري أمراً هاماً
فهو يعد المرحلة الأولي لعملية استقبال
اي شئ يراه الطفل ومن ثم فهمه وتخزينه.
بالتالي قد تحتاج إلي تقييم الطفل
وتدريبه علي الحضور والانتباه البصرى
كخطوة أولى.
2- الانتباه السمعي:
ويقصد بالانتباه السمعي هو احساس الطفل
بوجود مثير سمعي (صوت معين) حوله
والالتفات له. فاذا قمت بعمل صوت مثل طرق
ملعقة علي كوب مياه مثلاً ، فأن الصوت
يجذب انتباه الطفل بحيث يلتفت إلي مصدر
الصوت وينظر إلي الملعقة او الكوب. وقد
يعاني بعض الاطفال من مشكلة ضعف
الانتباه السمعي بحيث لا ينجذب إلي
الأصوات التي تحدث من حوله بسهولة ،
وبالتالي فان تدريب الاطفال علي الحضور
والانتباه السمعي أمراً هاماً فهو يعد
المرحلة الأولي لعملية الاستقبال اي شئ
يسمعه الطفل ومن ثم فهمه وتخزينه.
بالتالي قد تحتاج إلي تقييم الطفل
وتدريبه علي الحضور والانتباه السمعي
كخطوة أولى.
3- التركيز البصري:
هناك فارق بين الانتباه والتركيز ،
فالانتباه البصري يقتصر علي مجرد النظر
لمصدر الضوء كالمثال السابق ، اما يقصد
بالتركيز البصري هو استمرار النظر إلي
مصدر الضوء لمدة معينة. ويساعد هذا
الأمر علي النظر إلي المثيرات البصرية
(الاشياء) لمدة أطول وبالتالي استقبالها
الاشياء التي يراها وفهمها وتخزينها
بشكل أفضل. فأعلم انه قد تحتاج إلي تقييم
الطفل وتدريبه علي زيادة مدة التركيز
البصري.
4- التركيز السمعى:
كما ذكرنا فهناك فارق بين الانتباه
والتركيز ، فالانتباه السمعي يقتصر علي
مجرد الاحساس بمصدر الصوت والالتفات له
كالمثال السابق. اما تركيز الانتباه
السمعي فمعناه استمرار تركيز الطفل علي
مصدر الصوت والاستماع له لمدة معينة.
ويساعد هذا الأمر علي الاستماع إلي
المثيرات السمعية (الأصوات أو كلام
الأخرين) لمدة أطول وبالتالي استقبال
المعلومات التي يسمعها وفهمها وتخزينها
بشكل أفضل. فأعلم انه قد تحتاج إلي تقييم
الطفل وتدريبه علي زيادة مدة التركيز
السمعي.
أقرا ايضاً : بالصور 20 نشاط لزيادة
الانتباه والتركيز عند الاطفال
5- الإدراك البصري:
يقصد بالإدراك البصري هو تفسير
المثيرات (الاشياء) التي يراها الطفل
ومعرفة خصائصها من حيث الشكل والتمييز
فيما بينها. ويلعب تدريب الاطفال علي
بعض مهارات الإدراك البصري مثل: التطابق
بين المجسمات والصور علي تنمية جانب
الادراك البصري بالقدر الذي يساعده علي
التمييز بين الاشياء التي قد تتشابه في
الشكل أو اللون ، وبالتالي عدم الخلط
بين اسماء الاشياء (مثل طماطم وتفاحة)
عند تعليمه لها نظراً لتشابههم في
اللون. كما يساعده علي تعميم مفهوم
الاشياء بسهولة ، فقم بتقييم الطفل في
مهارة التطابق فقد تحتاج إلي تدريبه
عليها.
6- الادراك السمعي:
يقصد بالإدراك السمعي هو تفسير
المثيرات (الأصوات) التي يسمعها الطفل
وفهمها والتمييز فيما بينها. وقد يظهر
علي الطفل مدي ادراكه وتمييزه للأصوات
التي يسمعها في تمييزه صوت أمه عن أبيه
مثلاً ، ويساعد تدريب الطفل علي فهم
كلمة (لا) وتنفيذ الأوامر البسيطة علي
زيادة وعي وفهم الطفل للأصوات التي
يسمعها من الأخرين وان كلام الاخرين ذو
معني وهي تعد الخطوة الأولى في اللغة
الاستقبالية لديه.

7- الانتباه المشترك:
ويقصد بالانتباه المشترك هو أن يقوم
الطفل بتركيز انتباهه مع شخص أخر علي شئ
معين. فمثلا عندما تقوم بتحريك لعبة
للامام والخلف ، يقوم الطفل بالنظر معك
إلي اللعبة وتركيز انتباهه عليها. وذلك
يساعد الطفل فيما بعد علي فهم واستيعاب
الكلمات التي تحاول تعليمه لها. فعندما
تقوم بتعليمه كلمة تفاحة مثلاً ، سيقوم
الطفل بمشاركة الانتباه معك في النظر
إلي التفاحة والتركيز علي شكلها
والاستماع لاسمها وبالتالي تخزينها
ونطقها فيما بعد. عليك بتقييم الطفل في
جانب الانتباه المشترك ووضع الأهداف
التدريبية المناسبة له.
8- التواصل البصري:
يقصد بالتواصل البصري هو نظر الطفل لك
في عينك لمدة معينة. ويساعد التواصل
البصري علي تحسين عملية التواصل ككل،
وتحسين عملية اكتساب الكلمات، وتعلم
الكلام من الأخرين وتحسين النطق، حيث
انه يساعد الطفل علي تركيز الانتباه علي
وجه المتحدث، وتوجيه التركيز له،
وملاحظته جيداً اثناء النطق، والاستماع
له بشكل جيد، وكذلك ملاحظة حركات الفم
والشفاة، ومعرفة كيف تنطق الكلمة،
وبالتالي سهولة تقليد نطقها فيما بعد.
فاذا يعاني الطفل من قصور في التواصل
البصري ، لابد من تدريبه علي زيادة مدة
التواصل البصري.
9- التقليد:
يلعب التقليد (التعلم بالملاحظة
والمحاكاة) دوراً هاماً في تعليم
الأطفال الكثير من الأشياء بما فيها
اللغة والكلام. ويتم ذلك عن طريق ملاحظة
الطفل شخص أكبر منه اثناء قيامه بسلوك
معين وتقليد ذلك السلوك. ويلعب التقليد
دوراً هاماً في اكتساب الاطفال اللغة عن
طريق ملاحظة كلام الكبار وطريقه نطقه
وتقليده مرة أخرى. ويتدرج تدريب الأطفال
علي التقليد اذا وجدت صعوبة لديهم به ،
فقد تحتاج إلي تقييم الطفل في جوانب
التقليد المختلفة من تقليد حركات كبري،
وحركات صغرى، وحركات الشفاة وللسان،
والتقليد الصوتي لأصوات الحيوانات
والمقاطع (با تا)، وترديد الكلمات،
وتدريبه علي جوانب القصور به.
10- الطلب بالإشارة:
ويقصد به ان يشير الطفل إلي الشئ الذي
يريده محاولة منه للحصول عليه. ويساعد
تدريب الطفل علي الطلب من خلال الإشارة
إلي تنمية القدرة لديه علي الطلب
بالأصوات والكلمات والجمل فيما بعد،
وبالتالي تنمية الجانب التعبيري لديه.
عليك تقييم الطفل في الطلب بالإشارة
وتدريب الطفل علي الطلب اذا عاني من
قصور به.
أقرا ايضاً : تأخر اللغة والكلام | تعريف
، أعراض ، أسباب ، علاج
توصيات تخص مهارات ما قبل اللغة
قد تزيد مهارات ما قبل اللغة عما ذكرت.
وقد يصنفها البعض بطرق وأساليب أخرى
وينقص منها نقاط او يزيد عليها نقاط.
ولكنني حاولت جمع كافة النقاط الأساسية
من منظوري، والتي من شأنها مساعدة
الاطفال التي لا تنطق اي كلمات بعد
تدريبهم علي كافة المهارات المذكورة
كلها علي البدأ في معرفة وتمييز ونطق
كلماتهم الأولى، وبدون أي معوقات ترجع
إلي غياب أحد المهارات الهامة لديهم.
ويساعد فهمك للنقاط الخاصة بمهارات ما
قبل اللغة والتي قمت بشرحها مسبقاً علي
إدراك المشكلة التي قد يعاني منها الطفل
في أحدى تلك المهارات ومدى تأثيرها علي
تعلم اللغة لديه. واذا اكتشفت قصور في
أحدى هذا المهارات ، فليس عليك بعدها
سوء أن تقوم بوضع الانشطة التي تساعدك
علي تأهيل الطفل في كل مهارة من
المهارات التي يعاني من قصور بها. وذلك
حتي تبني لديه أساساً قوياً يستطيع من
خلاله تعلم كلماته الأولى بسهولة ويسر
وتلقائية دون جهد كبير ومحاولات يائسة
كثيرة.
ولا تنسى الاهتمام بجانب التواصل
والتفاعل الاجتماعي خاصة مع أطفال
التوحد ، فهو يلعب دوراً هاماً بجانب
المهارات التي سبق ذكرها.
لا تغنى المهارات المذكورة عن التدخل من
خلال المتخصصين والذي يكون عادة أخصائي
التخاطب ، أخصائي التربية الخاصة.
فالتقييم من المتخصصين والتدخل
والتأهيل القائم عليهم يساعد علي
الوصول إلي أقصي درجات النجاح.
"""
    },

    {
      "name": "تأخر اللغة والكلام | تعريف ، أعراض ،أسباب ، علاج",
      "text": """تأخر اللغة وتأخر الكلام وتأخر النطق ،
هي مصطلحات يستخدمها العديد لوصف مشكلة
واحدة تقريباً تتعلق باللغة. تلك
المشكلة -وهي تأخر اللغة بمسماها العلمي
الصحيح – تعد من المشكلات الشائعة التي
تصيب العديد من الأطفال. وتصبح مصدراً
لقلق العديد من أولياء الأمور. خاصة وأن
ملامح تاخر اللغة عند الطفل قد تبدو
واضحة تماماً للجميع ، فقد يتسم بعض
الأطفال بتأخر الكلام واللغة الذي قد
يصل إلي الضعف الشديد للغة، وعدم القدرة
علي التحدث بأي كلمات علي الإطلاق.
ونظراً لأهمية تلك المشكلة وضرورة
التعامل معها ، نوضح في المقال التالي
كافة النقاط المتعلقة بتأخر الكلام
والتي هي كالآتي:
أضغط علي الجزء الذي تريد القراءة عنه
للانتقال إليه.
    ما هو تأخر اللغة؟
    أعراضه
    أسبابه
    علاجه
ما هو تأخر اللغة؟
تأخر اللغة هو مشكلة تحدث عند الأطفال
حينما لا يتساوي نمو الطفل اللغوي مع
مثله من أقرانه ، أي عندما لا تشبه لغة
الطفل لغة الأطفال من نفس عمره ، فعلي
سبيل المثال: إذا طفلك لديه من العمر 3
سنوات ، فأن الأطفال في هذا العمر عادةً
يمكنهم نطق جملة مكونة من 3 كلمات ، ففي
حالة أن ابنك لا يستطيع نطق جملة من 3
كلمات مثلهم ، فأنه علي الأغلب يعاني من
تأخر في اللغة (فهو لا يتكلم مثل الأطفال
من نفس سنه).
علامات وأعراض تأخر اللغة والكلام عند
الاطفال:
تختلف أعراض تأخر اللغة والكلام طبقاً
لسن الطفل ومتطلبات النمو اللغوي لكل
مرحلة سنية معينة ، ولكن لتعرف متى
يعتبر الطفل تأخر في الكلام ، تذكر أن
القاعدة الأساسية هي أنه مهما كان سن
الطفل ، فأنه عندما تقارنه بالأطفال
الأخرين من نفس عمره ، فإنك تجده لا
يتكلم مثلهم أو يعاني من قصور ما في
اللغة أو ينقصه شئ عنهم.
ولكن يمكنك التعرف علي بعض أعراض تاخر
الكلام واللغة الشائعة والتي هي كالآتي:
     تأخر المناغاة ونطق الأصوات في الفترة
من 8 لـ 12 شهر
     تأخر نطق الكلمة الأولي والتي تكون
عادة عند عمر 1 سنة.
     ضعف الحصيلة اللغوية بحيث تقل عن 50 : 200
كلمة عند عمر سنتين ، وتقل عن 900 كلمة عند
عمر 3 سنوات.
     تأخر في نطق الجمل. لا ينطق جملة من
كلمتين عند عمر سنتين ، ولا ينطق جملة من
3 كلمات عند عمر 3 سنوات.
     ضعف القدرة علي تركيب الجمل بطريقة
صحيحة ، تظهر عادة بعد عمر 3 سنوات وتشمل
أخطاء في ترتيب الكلمات في الجملة.
     اخطاء صرفية داخل الجمل. على سبيل
المثال: عدم التفريق بين المذكر والمؤنث
(ولد يأكل – بنت تأكل)، استخدام المفرد
والمثني والجمع (عربية – عربيتين –
عربيات). وتظهر عادة بين 3 : 5 سنوات.
     اضطرابات النطق بحيث تجعل نطقه غير
واضح للجميع وخاصة الغرباء.
وهناك العديد من الأعراض الأخرى. ولكن
الأعراض السابقة هي أكثر أعراض تأخر
الكلام شيوعاً عند الأطفال. ويجب مراعاة
الفروق الفردية بين الأطفال ، فقد يتأخر
بعض الأطفال في اكتساب الكلمات أو في
نطق الجمل عند سن معين. وهذا قد يكون
طبيعياً، وقد يرجع إلي العديد من
العوامل منها البيئة والأسرة ومدى
إسهامها في تعليم الطفل.
في حالة حدوث أحد الأعراض السابقة عند
طفلك. عليك الذهاب لأقرب أخصائي تخاطب
لإجراء التقييم والتشخيص اللازم ومعرفة
إذا كان الأمر في نطاق الطبيعي أم يحتاج
نوعاً من التدخل والتأهيل.
 
أسباب تأخر الكلام واللغة:
تتعدد وتتنوع أسباب تأخر الكلام عند
الاطفال من طفل لأخر، وتتمثل الأسباب
الشائعة في الآتي:
1- التأخر العقلي:
يعتبر التأخر العقلي من أحد أهم أسباب
التأخر اللغوي. فإكتساب اللغة
وممارستها يحتاج إلي وجود قدرات عقلية
سليمة تساعد علي فهم تلك اللغة
وتفسيرها، وإعادة إستخدامها في سياقات
مختلفة، وكذلك فهم مدلولات ومعاني
الكلمات. وبذلك فإن النمو اللغوي يتأثر
بضعف القدرات العقلية عند الطفل، فيؤدي
التأخر العقلي إلي تأخراً عاماً في
اللغة ، وتؤدي المتلازمات التي تسبب
التأخر العقلي مثل الداون بطبيعة الحال
إلي تأخراً في اللغة. ولكن ليس بالضرورة
أن كل طفل يعاني من تأخر اللغة يعاني من
التأخر العقلي.
2- ضعف السمع:
يلعب السمع دوراً هاماً في عملية
التواصل وفهم اللغة، وكذلك يلعب دوراً
رئيسياً في تعلم واكتساب اللغة. وفي
حالة حدوث أي مشكلات في عملية السمع ،
فأنها بطبيعة الحال تؤثر علي استخدام
اللغة وتطورها. فكيف من الممكن ان يتعلم
الطفل الكلام من الأخرين وهو لا يستطيع
سماعهم جيداً في الاساس. ولذلك تعتبر
سلامة السمع وخاصةً في السنوات الأولى
من حياة الطفل أمر هاماً لنمو اللغة
والكلام. ويؤدي ضعف السمع أو فقدانه في
مرحلة مبكرة من النمو إلى تأخر الكلام ،
وتصبح قدرة الطفل على التعبير محدودة
جداً.
3- الحرمان البيئي أو الفقر البيئي:
تلعب البيئة متمثلة في الأسرة والمنزل
والروضة دوراً هاماً في تعليم الطفل في
كافة جوانب حياته وتنمية مهاراته
جميعها وخاصة مهاراته اللغوية. وفي حالة
الفقر البيئي والذي يعني ضعف المثيرات
الموجودة في البيئة التي تساعد الطفل
علي التعلم مثل غياب كلام الأهل بكثرة
مع الطفل ، انشغال الأهل عن الطفل أو
تركه لساعات طويلة أمام التلفاز أو
الهاتف دون وجود حوار مثمر يتعلم ويكتسب
منه اللغة. فهذا يؤدي إلي عدم تطور اللغة
بشكل كافي وحدوث مشكلة تأخر الكلام
واللغة. ولهذا السبب يوجد حالات تتأخر
في نمو اللغة في المستويات المحرومة
ثقافياً واجتماعياً واقتصادياً
وعاطفياً.
4- اضطراب طيف التوحد:
يؤثر التوحد علي عملية التواصل عموماً
وبطبيعة الحال يؤثر علي عملية اكتساب
اللغة وممارستها محدثاً تأخراً عاماً
في اللغة. ولكن ليس بالضرورة أن كل طفل
يعاني من تأخر اللغة يعاني من التوحد.
5- ازوداجية اللغة أو ثنائية اللغة:
يؤثر تعليم الطفل لغة ثانية أو تعرضه
للغة أخري غير لغته الأم في سنواته
الأولى علي تعلم الطفل للغته الأم
وإكتسابها مثل مشاهدة الأطفال
لفيديوهات اليوتيوب للغات مختلفة مثل
الصينية واليابانية والانجليزية ، وقد
يؤدي هذا إلي اضطرابات في لغته الأم أو
تأخرها عموماً.
أقرا ايضاً : ثنائية اللغة (ازدواجية
اللغة) | متي يضر تعلم لغة ثانية طفلك؟
6- الإصابة الدماغية (إصابة الجهاز
العصبي):
يحتاج فهم وتكوين الكلمات إلى وظيفة
دماغية سليمة من حيث النشاط العضلي
العصبي والقدرة الذهنية – حيث أن
الدماغ هي موضع إدراك وفهم وتداخل
عمليات الكلام – . لذلك قد يتأخر الطفل
في نمو اللغة لديه عند اضطراب وظيفة
الدماغ أو أحد المراكز المسئولة عن فهم
ومعالجة وإرسال وممارسة الكلام.
علاج تأخر اللغة والكلام:
يتم علاج تأخر الكلام عند الأطفال عن
طريق عملية التأهيل، والتي تتمثل في
الجلسات المكثفة من المتخصصين، وتكون
من قبل أخصائي التخاطب ، وتتمثل عادة في
العديد من الخطوات والتي منها:
     دراسة الحالة
     تقييم الطفل
     عمل الفحوصات والاختبارات اللازمة
والتي عادةً تتمثل في:
     زيارة طبيب المخ والأعصاب
     فحص السمع
     أختبار الذكاء
     أختبار اللغة
     تشخيص الطفل
     وضع البرامج التأهيلي التخاطبي الفردي
للطفل.
أقرا ايضاً : مهارات ما قبل اللغة | مفتاح
النطق والكلام لأطفال تأخر اللغة
والتوحد
يقوم برنامج التأهيل الفردي علي أهداف
وأنشطة تساعد علي علاج المشكلات
الموجودة في اللغة للحد من تأخرها
وعلاجها للوصول للطفل إلي مستوي اللغة
المطلوب والمناسب لسنه.
"""
    },
    {
      "name": " علاج اللدغات (اضطرابات النطق) عندالأطفال",
      "text": """تعد اضطرابات النطق/اللدغات الكلامية
(اللثغات) من المشكلات التي تواجه
العديد من الأطفال. وهي تعتبر أحد أكثر
أنواع اضطرابات التواصل انتشاراً
وشيوعًا بين الأطفال. ورغماً من ذلك،
إلا أنه من السهل علاج اللدغات عند
الأطفال وحتى عند البالغين.
تظهر اضطرابات النطق بشكل واضح في عدم
وضوح النطق لدى الطفل وصعوبة فهم كلامه.
وتكون نتيجة صعوبة في نطق بعض الحروف
والأصوات بشكل صحيح أو استبدالها
بأصوات أخرى.
وفي هذا المقال تقرأ عن:
     ما هي اضطرابات النطق
     انواع اضطرابات النطق
     أمثلة لبعض اللدغات.
     خطوات علاج اللدغات.
     ارشادات ونصائح لتحسين النطق عند
الأطفال
ما هي اضطرابات النطق؟
هي صعوبات في نطق الأصوات الضرورية
للكلام وخروج هذه الأصوات بشكل غير
سليم، وقد تحدث هذه الصعوبات في صورة
مشكلة في نطق صوت معين في أول أو وسط أو
آخر الكلمة.
أنواع اضطرابات النطق:
     الحذف: يحذف الطفل صوتاً / حرفاً يصعب
نطقه من الكلمة أو مقطعًا يصعب نطقه من
الكلمة.
     الابدال: يستبدل الطفل صوتاً يسهل نطقه
مكان الصوت الاصلي في الكلمة.
     التشويه / التحريف: إصدار صوت بشكل غير
سليم وبأسلوب خاطئ ومحرف عن الصوت
الاصلي.
     الإضافة: اضافة صوتاً أو مقطع صوتي
يمكن تمييزه أو غير مميز، وتكون الاضافة
في أول و ووسط وآخر الكلمة.
أقرا عن : اسباب وانواع اضطرابات النطق /
اللدغات بالتفصيل
أمثلة على اضطرابات النطق في بعض الحروف
(اللثغات):
     اللثغة السينية /س/:
– اللثغة السينية الأمامية.
– اللثغة السينية الجانبية.
– اللثغة السينية البلعومية.
     اللثغة الرائية /ر/:
تحدث نتيجة خطأ في نطق صوت /ر/، حيث يتطلب
صوت /ر/ وضع اللسان قرب اللثة العليا مع
اهتزاز طرف اللسان. فيتعذر على الطفل
نطقها، ويقوم بإبدالها بأصوات (/ي/، /ل/،
/غ/)، أو يحذفها تمامًا من الكلمة.
     اللثغات الخلفية إلى الأمامية:
وبها يصعب على الطفل نطق الأصوات
الخلفية، فيقوم بتبديلها بأصوات أمامية
يسهل نطقها. مثال: ابدال صوت (/ك/ بــــ
/ت/)، (/ج/ بــــ /د/)، وأحيانًا يتم إبداله
بصوت /أ/.
 
خطوات علاج اللدغات (اضطرابات النطق):
يقدم التأهيل التخاطبي، عن طريق أخصائي
التخاطب، تدخلًا سريعًا وفعّالًا في
علاج اللثغات عند الأطفال. حيث يتضمن
تقييم الأصوات لدى الطفل، وتحديد عدد
الأصوات التي بها مشكلة وأسبابها. كما
يتم تحديد طرق العلاج والتأهيل
الصحيحة، وجلسات التخاطب اللازمة
لتصحيح الأصوات التي ينطقها الطفل بشكل
غير صحيح. يتكون منهج تأهيل وعلاج
اللثغات عند الأطفال والكبار، لتعديل
نطق صوت /س/ على سبيل المثال، من الخطوات
الآتية:
خطة تخاطب علاجية لـتصحيح اللدغة
السينية /س/
الخطة العلاجية لعلاج اللدغة السينية
على سبيل المثال، تتضمن التدريب علي نطق
الصوت كالآتي:
     مخرج صوت /س/ منفرد: (سسسسسسس).
     نطق صوت /س/ في مقاطع: (سا – سي – سو) –
(سا سي -سا سو – سي سو سا).
     أول الكلمة: (سد – سلم – سكر – سمك –
سرير – سياره – سفينة).
     وسط الكلمة: (أسنان – اسد – لسان –
مسجد – مسلم – اسود – اسبوع).
     أخر الكلمة: (خس – تنس – حرس – جرس –
شمس – بطاطس).
     مكرر في كلمة: (مسدس – سمسم – سلسله –
رمسيس – سويس).
     جملة: (كرسي مكسور – مسحوق الغسيل –
أسد سريع).
     قصة قصيرة.
     حوار مسترسل.
أقرا ايضاً : تعليم الأطفال نطق مخارج
الحروف والأصوات العربية كلها
ارشادات ونصائح لتحسين النطق عند
الاطفال:
     عندما ينطق طفلك إحدى الكلمات أو أحد
الأصوات بشكل خاطئ، قدم نطق الكلمة
أمامه مرة أخرى حتى يدرك النطق الصحيح
ويحاول نطقها مثلك في المرات القادمة.
     قم بتوضيح مخارج الحروف التي يجد ابنك
صعوبة في نطقها، عبر توضيح حركة اللسان
والشفاه أثناء عملية النطق، حتى يتعرف
على مخرج الصوت وكيفية نطقه بشكل سليم.
     قسّم الكلمات الصعبة إلى عدة مقاطع مثل
(اش-رب)، (طا-ما-طم)، (عا-را-بيه)،
(شو-كو-لا-ته).
     لا توبخ طفلك أو تلومه بأنه لا يستطيع
نطق الأصوات بطريقة صحيحة، بل شجعه على
المحاولة والمثابرة، وكافئه عند قيامه
بمحاولات صحيحة وحفزه عند قيامه
بمحاولات خاطئة.
أعلم أن في بعض الأحيان قد لا تكون تلك
الإرشادات كافية لعلاج مشكلة النطق عند
ابنك. ولذلك، عليك أولاً زيارة أخصائي
تخاطب لتحديد مستوى ابنك بشكل سليم
وتحديد أفضل أسلوب للتعامل مع المشكلة
التي لديه. فكل طفل حالته فريدة، ولكل
طفل منهج تأهيلي فريد وخاص.
وبهذا نكون قد انتهينا من شرح اضطرابات
النطق وأنواعها، وخطوات علاج اللدغات
عند الأطفال والكبار. كما أنه قد تم
تقديم أهم النصائح التي تساعد على تحسين
النطق لدى طفلك.
"""
    },
    {
      "name": " تعليم الأطفال نطق مخارج الحروف والأصوات العربية كلها",
      "text": """كثيراً ما تواجهنا مشكلات عند تعليم
مخارج الحروف للاطفال، فقد تظهر صعوبات
في عملية نطق الحروف والأصوات عند
الاطفال، وعلامات اضطرابات النطق قد
تتمثل في ابدال بعض الحروف أي نطق حرف
بدلاً من حرف أخر، أو تشويه الحرف نفسه
وعدم نطقه بطريقة صحيحة، أو عدم القدرة
علي نطق الحرف على الأطلاق.
وفي هذا المقال نستعرض مخارج الحروف
والأصوات العربية جميعها وصفاتها، وكيف
تقوم في خطوات بسيطة تعليم مخارج الحروف
للاطفال وتصحيح وضبط كل حرف وصوت من
الحروف والأصوات، سواء كنت أخصائي
تخاطب أو ولي أمر الطفل نفسه.
قبل البدأ ميز بين المصطلحات التالية:
     صوت احتكاكي: خروج الهواء في تتابع من
مجري ضيق من الفم لأحداث الصوت.
     صوت انفجاري: احتباس الهواء وراء نقطة
معينة من الفم أو اللسان وخروجه مرة
واحدة.
     صوت مهموس: هو الصوت الذى تهتز فيه
الأحبال الصوتية بدرجة بسيطة.
     صوت مجهور: هو الصوت الذي تهتز فيه
الأحبال الصوتية بدرجة قوية.
تعليم الاطفال نطق مخارج الحروف
والأصوات العربية
نطق حرف (أ)
المخرج: أقصي الحلق
التشكيل: احتباسي انفجاري
درجه الرنين: مجهور
التدريب: نضع يد الطفل علي أقصي الحلق
عنده وعند المدرب ليشعر بأهتزاز
الاحبال الصوتية عند نطق الصوت ويقلده.
نطق حرف (ب)
المخرج: الشفاة
التشكيل: احتباسي انفجاري
الرنين: مجهور
التدريب: نضع يد الطفل علي الشفاه مع
ملاحظه تطابق أو قفل الشفاه واحتباس
الهواء خلفها ثم يشعر بخروج الهواء بشكل
انفجاري.
نطق حرف (ت)
المخرج: طرف اللسان مع منابت الاسنان
العليا
التشكيل: احتباسي انفجاري
الرنين: مهموس
التدريب: نوجه لسان الطفل لأعلي تجاه
منابت الأسنان العليا ونطلب منه محاولة
النطق وتحريك لسانه مثلنا.
نطق حرف (ث)
المخرج: طرف اللسان مع الاسنان
التشكيل: احتكاكي
الرنين: مهموس
التدريب: وضع اللسان بين الاسنان ووضع
يد الطفل امام الفم ليشعر باحتكاك
الهواء الخرج من الفم علي يده.
نطق حرف (ج)
المخرج: وسط اللسان مع سقف الحلق
التشكيل: احتباسي انفجاري
الرنين: مجهور
التدريب: نثبت طرف اللسان لأسفل بحيث
يرتفع وسط اللسان لأعلي ونطلب من الطفل
النطق مثلنا ، وفي بعض الأحيان قد تحتاج
إلي تدريب الطفل علي حرف (د) أولاً.
 Sponsor 
  كلماتي - تعليم الأطفال الكلام 
كلماتي - تعليم الأطفال الكلام
تطبيق تعليم الاطفال النطق والكلام
وتنمية مهارة اللغة باللهجة المصرية
والسعودية وبالعربية الفصحى واللغة
الانجليزية.
نطق حرف (ح)
المخرج: وسط الحلق
التشكيل: احتكاكي
الرنين: مهموس
التدريب: ثلج /ماء دافئ يضع يده بها
نطق حرف (خ)
المخرج: ادني الحلق
التشكيل: احتكاكي
الرنين: مهموس
التدريب: تقليد صوت صفارة النوم أو نضع
يده علي الحلق حتي يشعر بخروج الصوت منه.
نطق حرف (د)
المخرج: طرف اللسان مع منابت الاسنان
العليا
التشكيل: احتباسي انفجاري
الرنين: مجهور
التدريب: نوجه لسان الطفل لأعلي تجاه
منابت الأسنان العليا ونطلب منه محاولة
النطق وتحريك لسانه مثلنا مع لمس
الحنجرة ليشعر باهتزاز الاحبال الصوتية
بقوة.
نطق حرف (ذ)
المخرج: طرف اللسان بين الاسنان مع
بروزه
التشكيل: احتكاكي
الرنين: مجهور
التدريب: وضع اللسان بين الاسنان ووضع
يد الطفل امام الفم ليشعر باحتكاك
الهواء الخرج من الفم علي يده مع لمس
الحنجرة ليشعر باهتزاز الاحبال الصوتية
بقوة.
نطق حرف (ر)
المخرج: طرف اللسان مع سقف الحلق
التشكيل: دائري تكراري
الرنين: مجهور
التدريب: تدريبه علي رفع اللسان ولف
اللسان بخافض للوراء ثم القائه للأمام
عند النطق فيخرج حرف الراء
نطق حرف (ز)
المخرج: طرف اللسان مع ما بين الثنايا
العليا والسفلى
التشكيل: احتكاكي
الرنين: مجهور
التدريب: يضع يده امام الشفاه ويشعر
بالهواء (ذبذبه)
نطق حرف (س)
المخرج: طرف اللسان مع ما بين الثنايا
العليا والسفلى
التشكيل: احتكاكي
الرنين: مهموس
التدريب: يضع يده أمام الشفاة ليشعر
باحتكاك الهواء البارد مع فرد الشفاه.
نطق حرف (ش)
المخرج: وسط اللسان مع سقف الحلق
التشكيل: احتكاكي
الرنين: مهموس
التدريب: وضع قبضة اليد امام الشفاة مع
تدوير الشفاة مع شعوره بالهواء الساخن
أقرأ أيضاً: علاج اضطرابات النطق (علاج
اللدغات) عند الاطفال
نطق حرف (ص)
المخرج: طرف اللسان خلف الاسنان العليا
وأقرب للسفلي
التشكيل: احتكاكي
الرنين: مهموس
التدريب: التدريب علي صوت (س) ثم فتح الفم
فيخرج (ص) مع ضم الشفاة قليلا
نطق حرف (ض)
المخرج: وسط اللسان مع سقف الحلق مع
الميل الي احد الحواف وخاصه اليسري
التشكيل: احتباسي انفجاري
الرنين: مجهور
التدريب: قطعة كرتون توضع بين الضروس
(اليسري) ويميل اللسان الي الحواف فيخرج
(ض)
نطق حرف (ط)
المخرج: طرف اللسان مع الاسنان العليا
التشكيل: احتباسي انفجاري
الرنين: مجهور /مهموس
التدريب: ننطق (ت) مع الضغط بالسبابة
برفق علي أسفل الفك السفلي لفتحه اثناء
نطق الحرف فيخرج (ط)
نطق حرف (ظ)
المخرج: طرف اللسان بين الاسنان مع
البروز قليلا
التشكيل: احتكاكي
الرنين: مجهور
التدريب: وضع اللسان بين الاسنان ووضع
يد الطفل أمام الفم حتي يشعر بالهواء مع
وضع اليد الأخري علي رأسه ليشعر بذبذبة
الحرف العالية عند نطقه.
نطق حرف (ع)
المخرج: وسط الحلق
التشكيل: احتكاكي
الرنين: مجهور
التدريب: نمسك يد الطفل ونضعها علي
الحنجره فيشعر بخروج الحرف.
نطق حرف (غ)
المخرج: ادني الحلق
التشكيل: احتكاكي
الرنين: مجهور
التدريب: نضع ماء ونمسك أنفه حتي لا يبلع
الماء (الغرغرة) مع الامساك بالحنجرة
ليشعر بالحرف.
نطق حرف (ف)
المخرج: شفهي أسناني/ الأسنان العليا مع
الشفاة السفلي
التشكيل: احتكاكي
الرنين: مهموس
التدريب: يضع الأسنان العليا علي الشفاة
السفلي ويقوم بالنفخ أو ينفخ في شمعه
فيشعر باحتكاك الهواء اثناء خروج الحرف
نطق حرف (ق)
المخرج: مؤخره اللسان مع سقف الحلق
التشكيل: احتباسي انفجاري
الرنين: مهموس
التدريب: نثبت طرف اللسان لأسفل ونرجع
اللسان إلي الوراء أقصي سقف الحلف بحيث
ترتفع مؤخرة اللسان ملامسة سقف الحلق
ونطلب من الطفل نطق الحرف مثلنا.
نطق حرف (ك)
المخرج: بين (ق) و(ج) بين وسط اللسان واخره
التشكيل: احتباسي انفجاري
الرنين: مهموس
التدريب: نثبت طرف اللسان لأسفل بحيث
يرتفع وسط اللسان لأعلي مع توجيه اللسان
للوراء قليلاً ونطلب من الطفل النطق
مثلنا.
نطق حرف (ل)
المخرج: طرف اللسان مع لثة الأسنان
العليا داخل الفم
التشكيل: جانبي
الرنين: مجهور
التدريب: يثبت طرف اللسان عند لثة
الأسنان العليا عند منابت الاسنان
العليا من داخل الفم وينطق الحرف
بالتقليد.
نطق حرف (م)
المخرج: شفهي /انفي
التشكيل: أنفي
الرنين: مجهور
التدريب: اهتزاز الانف والشفاة بوضع
السبابتين علي جانب الشفاه والأخرى علي
الانف ليشعر باهتزاز ورنين الأنف.
نطق حرف (ن)
المخرج: طرف اللسان مع منابت الأسنان
العليا
التشكيل: أنفي
الرنين: مجهور
التدريب: وضع طرف اللسان عليمنابت
الأسنان العليا مع وضع أصبع الطفل على
الأنف ليشعر باهتزاز ورنين الأنف.
نطق حرف (هـ)
المخرج: أقصي الحلق
التشكيل: احتكاكي
الرنين: مهموس
التدريب: ينفخ في مرأه ليتكون بخار ماء
نطق حرف (و)
المخرج: شفهي
التشكيل: احتكاكي
الرنين: مجهور
التدريب: نقور الفم باليدين وشعور الطفل
باحتكاك الحرف
نطق حرف (ي)
المخرج: وسط اللسان مع سقف الحلق
التشكيل: احتكاكي
الرنين: مجهور
التدريب: الضغط علي طرف اللسان ليرتفع
الوسط مع احتكاك الحرف
وبهذا نكون انتهينا من عرض مخارج الحروف
وصفاتها (مخارج الأصوات) وطريقة تشكيل
الأصوات ورنين الأصوات وكذلك طريقة
تدريب وتعليم مخارج الحروف للاطفال
وتصحيح مخارج الحروف عند الاطفال.
أقرأ أيضاً: اسباب وانواع اضطرابات
النطق (اللدغات)
"""
    },
    {
      "name": " شروط جلسة التخاطب الناجحة",
      "text": """من المهم معرفة شروط جلسة التخاطب
الناجحة لإدارة جلسات التخاطب جيداً،
وتحقيق أقصي درجات النجاح مع الطفل ،
ولا تقتصر الشروط علي نظام الجلسات مثل
مدة جلسة التخاطب وعدد مراتها فقط ،
ولكن تتسع لتشمل شروطاً عديدة ، وفي هذا
المقال نقدم لك بالتفصيل:
    شروط جلسة التخاطب الناجحة
    شروط قاعة جلسات التخاطب الجيدة
شروط جلسة التخاطب الناجحة:
     اعتدال مدة جلسة التخاطب وعدم
المبالغة فيها أو التقليل منها. (عادةً
تكون مدة جلسة التخاطب الواحدة حوالي 30
دقيقة تقريباً ، وقد تصل إلي ساعة مع
الحالة التي تحتاج إلي تأهيلاً مكثفاً)
     اعتدال عدد مرات جلسات التخاطب
أسبوعياً (عادةً تكون من أثنين إلي 3
جلسات أسبوعياً).
     التأكد من قضاء الطفل كل احتياجاته
الاساسية قبل الجلسة من أكل وشرب وحمام.
     تهيئة الطفل قبل البدأ في الجلسة
وتكوين علاقة ايجابية تفاعلية معه.
     تجهيز الأدوات قبل البدأ في الجلسة
والتي قد تشمل:
     خافض اللسان.
     القفازات (الجلافز).
     المعززات.
     أدوات التدريب علي النفخ والشفط عند
الحاجه مثل : صفارة ، شمعة ، أوراق ملونة
، شفاطة.
     كروت التخاطب والمجموعات الضمنية
المطلوبة للأنشطة.
     تخصيص وقت للأهل بعد كل جلسة لتبسيط
وتوضيح الأنشطة بهدف مساعدتهم علي
العمل مع الطفل بالمنزل.
     العمل علي دراسة شخصية الطفل وسلوكه
وعلاج المشكلات السلوكية التي قد يعاني
منها والتي قد تعوق مسار الجلسة مثل
العند والعدوانية.
     فهم الاضطرابات التي قد يعاني منها
والتي قد تعيق مسار الجلسة وفاعليتها
والعمل علي حلها مثل تشتت الانتباه.
     تأهيل الطفل وفقاً لخطة فردية (برنامج)
بناء على جوانب القوة والضعف لديه
واحتياجاته التدريبية.
     توافر بعض من الصفات في اخصائي التخاطب
والتي يتمثل بعضها في الآتي:
     التخصص والمعرفة العلمية والعملية
والأكاديمية في مجال التخاطب.
     الثقه بالنفس.
     سلامة اللغة.
     الأمانة المهنية.
     الصبر.
     المرونة.
أقرا ايضاً : تأخر اللغة والكلام | تعريف
، أعراض ، أسباب ، علاج

شروط قاعة جلسات التخاطب الجيدة:
     مساحه القاعة تكون متوسطة ومناسبة ، لا
صغيرة ولا كبيرة.
     القاعة تكون جيدة التهوية عن
طريق الشبابيك والمراوح.
     احتواء القاعة علي دولاب للأدوات.
     توفير مرآة بالغرفة.
     لا يكون بالقاعة علي الحوائط أي مشتتات
لانتباه الطفل.
     القاعة تكون جيدة الاضاءة ويفضل لونها
أن يكون فاتح لبث الراحة والتقبل في نفس
الطفل.
     تكون بعيدة عن الضوضاء حتي يتمكن الطفل
من التركيز والسماع جيداً.
     أرضية القاعة من الفوم للحفاظ علي
الطفل عند الوقوع حتي لايصاب بالاضرار.
     الترابيزة أو المائدة يكون ارتفاعها
متوسط ومناسب للطفل، فليست عالية أو
منخفضة بشدة.
     تخصيص مسافة مناسبة بين الطفل
والاخصائي بحيث يري الطفل الاخصائي
جيداً، ويري حركات الشفاة واللسان ،
ويستطيع تقليده عند النطق بسهولة.
وبهذا نكون انتهينا من عرض أهم شروط
جلسة التخاطب الناجحة علي كافة الجوانب.
"""
    },
    {
      "name":
          " نظرية الترميز الثنائي المرتبط بالحركة لتدعيم تذكر المجموعات الضمنية",
      "text": """ما هي نظرية الترميز الثنائي؟
هي نظرية تحاول تفسير التخيل العقلي ،
قام بوضع النظرية العالم الكندي ألان
بافيو عام 1971. ويفترض أن الذاكرة تتألف
من نظامين لترميز أو تشفير المعلومات:
     الترميز اللفظي أو اللغوي: وهو النظام
الأول، ويتعلق بالتعامل مع الوحدات
والبنية اللغوية المجردة.
     الترميز المرئي أو التصوري: وهو النظام
الثاني، ويتعلق بالموضوعات والوقائع
العيانية المحسوسة والملموسة أو
المصورة.
وبالتالي فإن نظرية الترميز الثنائي
تعد نظرية للمعلومات المعرفية العامة.
وفيها تمثل المثيرات الخارجية في شكل
أنظمة لفظية مثل اللغة أو المعلومات
المجردة الرمزية، وأنظمة غير لفظية
كالمعلومات المادية العيانية
والمحسوسة مثل الصور والأصوات البيئية
والأنماط الكتابية.
ويقترح بافيو أن عملية الاحتفاظ
بالمعلومات وتذكرها التي تعتمد علي
أسلوب الترميز الثنائي (أي تقديم المواد
اللفظية والبصرية مقترنة معاً) أفضل من
الاعتماد علي أسلوب الترميز الأحادي (أي
تقديم المواد اللفظية والبصرية منفردة
ومنفصلة عن بعضها البعض) حيث يجعل قدرة
الأطفال علي التذكر أقل.
ويعد الترميز الثنائي المرتبط بحركة
أسهل بكثير في التذكر من الترميز
الأحادي والترميز الثنائي الغير مرتبط
بحركة.
 
كيف نستفيد من النظرية في تحسين التذكر
عند الأطفال اثناء التدريب علي
المجموعات الضمنية؟
يمكن الاستفادة من نظرية الترميز
الثنائي عن طريق ربطها بالحركة لجعل
جلسة التخاطب أكثر فاعلية. وذلك عن طريق
(ربط الكلمة وصورتها -> بحركة أو إشارة)
وذلك لجعل الطفل يتذكر نطق الكلمة
بسهولة عند رؤية صورتها ، حيث تساعد
الحركة أو الإشارة الطفل علي تذكر الحرف
الأول من الكلمة الخاصة بالصورة أو الشئ
الذي يراه ، وبالتالي تذكر الكلمة التي
تدل علي الشئ او الصورة ونطقها.
أمثلة توضيحية لنظرية الترميز الثنائي
المرتبط بالحركة لتدعيم تذكر ونطق
اسماء الاشياء:
يساعد استخدام نظرية الترميز الثنائي
المرتبط بالحركة الطفل علي تذكر ونطق
الكلمة كلها من خلال تذكر حركة أو إشارة
للحرف الأول منها. فيتذكر الطفل الحركة
وبالتالي ينطق الحرف الاول من الكلمة
المرتبط بتلك الحركة. ثم يكمل نطق
الكلمة كلها ، ويمكن التدريب علي
النظرية كما يلي:
     للتدريب علي كلمة بقرة مثلاً ، نعرض
البقرة سواء كانت في صورة أو باستخدام
تطبيق كلماتي ، نشير إلي الشفاة بأصبع
اليد كإشارة علي مخرج صوت /ب/ في بداية
الكلمة.
     كلمة سمكة ، نشير إلي الصورة ثم نشير
إلي الاسنان كإشارة علي مخرج صوت /س/ في
بداية الكلمة.
     كلمة وردة ، نشير إلي الصورة ثم نضم
الفم جيداً كإشارة علي مخرج صوت /و/ في
بداية الكلمة.
     كلمة فول ، نشير بالإصبع طولياً علي
الشفاة السفلية كإشارة علي مخرج صوت /ف/
في بداية الكلمة.
     كلمة شجرة ، نمد الشفاة للإمام بشكل
ملحوظ كإشارة علي مخرج صوت /ش/ في بداية
الكلمة.
     كلمة خروف ، نقرنها بإشارة النوم التي
تشير الي صوت /خ/ في بداية الكلمة.
يراعي اثناء التدريب نطق الكلمة كلها
وليس فقط الجزء الأول منها. أي نطق الصوت
الأول منها المربوط بإشارة أو حركة
معينة ثم إكمال نطق باقي الكلمة. فالهدف
هو مساعده الطفل علي تذكر ونطق الكلمة
كلها من خلال تذكر الحرف الأول منها.
وقس علي ذلك كل مخرج من مخارج الأصوات
وإقران حركته بكلمة معينة وصورتها.
فيكون تذكر نطق الكلمة أسهل نتيجة
استخدام الترميز الثنائي المرتبط
بالحركة (أي الصورة واللفظ والحركة) ،
حيث يسهل علي الطفل تذكر الكلمة بسبب
مساعدتنا له بعمل الإشارة أو الحركة
التي تدل علي الحرف الاول منها.
لذلك أنصح زملائي أخصائيين التخاطب
وأولياء الأمور باستخدام الترميز
الثنائي مقترناً بحركة للحرف الهجائي
(صورة مع نطق الكلمة مع حركة (غير محددة)
للحرف الأول منها) ، حيث أنه أسهل في
الاستدعاء من الذاكرة للمعلومات من
الترميز الثنائي الغير مرتبط بحركة
(بمعني صورة مع تلقين الكلمة فقط).
"""
    },
    {
      "name": "أسباب وأنواع اضطرابات النطق (اللدغات) ",
      "text": """تتنوع أسباب اضطرابات النطق أو كما تعرف
بـ اللدغات / اللثغات بين الاطفال. وتعد
اضطرابات النطق من المشكلات التي تنتشر
بين الكبار والصغار. وتحدث نتيجة اخراج
اصوات الكلام من مخارجها بطريقة غير
صحيحة، وبالتالي يخرج الكلام غير مفهوم.
وتأخد عادةً شكل الحذف والإبدال
والتشوية أو الإضافة لمقاطع واصوات
داخل الكلمات ، بحيث تجعلها نطقها غير
واضحاً.
تختلف الدرجة من اللثغة (اللدغة)
البسيطة (LISP) الي الإضطراب الشديد
وتتعدد اسباب اضطرابات النطق (اللدغات)
وأنواعها كما يلي:
    أنواع
    أسباب
أنواع اضطرابات النطق (اللدغات):
تتعدد وتتنوع انواع اللدغات (اضطرابات
النطق) طبقاً لطبيعة المشكلة التي تحدث
للأصوات داخل الكلمات ، وتتمثل الأنواع
في الآتي:
1- التشويه / التحريف:
الطفل ينطق الصوت بشكل أقرب من الصوت
العادي لكن لا يمثله تماماً، علي سبيل
المثال: ينطق (مدرثة بدلاً من مدرسة).
وينتشر هذا النوع بين الأطفال والصغار ،
ويمكن أن يحدث بسبب سقوط الاسنان، أو أن
يكون اللسان في موضعه غير الصحيح.
2- الحذف:
يقوم الطفل بحذف صوت من أصوات التي توجد
في الكلمه وينطق جزء فقط من الكلمة، علي
سبيل المثال: ينطق (طيخ بدلاً من بطيخ).
واذا حذف اصوات بشكل ثابت وتكرر في
الكلام يصبح كلام الطفل غير مفهوم.
3- الابدال:
إبدال أو إصدار صوت بدلاً من صوت اخر،
مثل: يستبدل صوت (ش) بصوت (س) فينطق (سمس
بدلاً من شمس)، أو يستبدل صوت (ك) بصوت (ت)
فينطق (تلب بدلاً من كلب). عيوب الابدال
هي الأكثر شيوعاً وانتشاراً بين
الأطفال الصغار.
4- الاضافة:
يقوم الطفل بإضافة صوت زائد إلي الكلمة،
مثل: (سسلاعليكم). فقد يتكرر صوت معين
داخل الكلمة ولكن المشكلة تختلف عن
التلعثم.

أسباب اضطرابات النطق (اللدغات):
تتعدد وتتنوع أسباب اللدغات (اضطرابات
النطق) عند الأطفال وتتمثل الأسباب
الشائعة في الآتي:
1- الاعاقة السمعية:
ترتبط حاسة السمع بمرحلة الاستقبال من
عملية الكلام ، وتعمل علي تكوين الحصيلة
اللغوية لدي الطفل التي تمكنه من ممارسه
الكلام. واذا حدث فقد سمع في الصغر كان
تأثير ذلك علي عملية الكلام أكثر صعوبة
، حيث تزداد اضطرابات النطق والكلام
كماً وكيفاً بزيادة درجه فقدان السمع
لدي الفرد ، لأن الطفل يستطيع سماع بعض
أصوات الكلام ولا يستطيع سماع الأخرى
ويستخدم ما يسمعه من الأصوات فقط في
الكلام ، وبالتالي يغلب علي كلامه الحذف
والتشويه والابدال.
2- اسباب ادراكية حسية:
والتي تتمثل في عدم قدرة الأطفال علي
التمييز سمعياً بين الأصوات المتشابهاً
نطقاً أو الأصوات الغير صحيحة التي
ينطقوها وبين الاصوات الصحيحة، فقد لا
يستطيع الطفل مثلاً التمييز بين صوت (ل _
ر) فتجده يقولاً (لاجل بدلاً من راجل).
ولذلك فإن الأطفال الذين يستمعون إلي
كلام الآخرين كثيراً ، يساعدهم ذلك علي
تنمية القدرة علي التميز السمعي
وبالتالي نطق الاصوات بصورة صحيحة.
3- المشكلات الحركية اللفظية:
بعض الأطفال الذين يعانون من اضطرابات
في النطق، يتميزون بعدم تناسق حركة الفم
عند الكلام ، لذلك زاد الاهتمام
بالجوانب الحركية لعملية الكلام التي
تؤثر بدرجة كبيرة في نطق الأصوات وتؤدي
إلي اضطراب النطق مثل: الأبراكسيا APRAXIA
والتي تظهر في عدم القدرة علي اصدار
وتنسيق تسلسل الحركات اللازمة للنطق.
كذلك الديسارثريا DYSARTHRIA الناتجة عن عدم
القدرة علي التحكم الإرادي في حركة
أجزاء جهاز النطق. و يتضح كلاهما في عدم
قدرة الفرد علي التحكم الإرشادي في
حركات جهاز النطق بدرجة مناسبة.
أقرا ايضاً : علاج اضطرابات النطق
(اللدغات)
4- خلل اجزاء جهاز النطق:
كما قد ترجع أسباب اضطرابات النطق
(اللدغات) إلي مشكلات في الاجزاء
المسئولة عن عملية النطق والمتمثلة في
الآتي:
1- شق الشفاة أو شق الحلق:
يمكن أن يودي إلي اضطراب النطق ويحدث
رنين للأصوات وتزداد الاصوات الانفية
وتختل الأصوات الاحتباسية والانفجارية.
2- مشكلات اللسان:
ففي حالة قصر رابط اللسان ، يصعب حركة
اللسان إلي إعلي بحرية، ولا يستطيع
الطفل نطق اصوات مثل (ل-ر). كذلك اختلاف
حجم اللسان يؤدي إلي اضطرابات النطق اذا
كان اللسان صغير أو كبير ويعوق عملية
تشكيل الأصوات. كما أن اندفاع اللسان
تجاه الاسنان العليا أو القواطع أثناء
البلع يؤدي إلى تشويه أو تحريف لبعض
الاصوات.
3- تشوه الاسنان:
يؤدي سقوط الأسنان الامامية العلوية
إلي اضطرابات النطق، والتي عادة ما تكون
موقتة وتزول مع طلوع الأسنان الجديدة.
كذلك الضعف في عظام الفك العلوي حيث
يؤخر عملية نمو الأسنان وتشوه شكلها مما
يعوق حركة اللسان.
4- أخطاء عمليات اصدار الأصوات:
وترجع إلي اخطاء في عملية تعلم و نطق
الأصوات نفسها، والذي قد يرجع إلي صعوبة
اتباع الأطفال قوعد إصدار بعض الأصوات
في بادئ حياتهم، فيقوموا بتبيسط عملية
انتاج الاصوات كي يسهل عليهم الكلام،
مما يحدث مشكلات واضطرابات في نطق بعض
الأصوات.
وبهذا نكون انتهينا من عرض اسباب
اضطرابات النطق (اللدغات / اللثغات)
وكذلك أنواعها جميع"""
    },
    {
      "name": "بحة الصوت | أعراض ،أسباب ، علاج ",
      "text": """إن بحة الصوت أو البحة الصوتية (Hoarseness)
من المشكلات التي تصيب الصوت عند
الأنسان كبيراً أو صغيراً، وتؤثر علي
طبيعة الصوت فتجلعه ضعيفاً وخشناً ، وفي
هذا المقال نقدم لكم كل المعلومات التي
تساعد علي فهم اسباب وعلاج بحه الصوت.
    ما هي بحة الصوت؟
    أعراضها
    أسبابها
    علاجها
أضغط علي الجزء المراد القراءة عنه
للانتقال إليه.
ما هي بحة الصوت ؟
هي تغير غير طبيعي في الصوت، يظهر في شكل
تغيير في طبقة الصوت وحدته ودرجة
ارتفاعه. نتيجة لذلك يصبح الصوت أما
خشناً أو ضعيفاً. وهي عرضاً قد يكون
مؤقتاً أو مزمناً، ولكن ليست مرضاً في
حد ذاتها.
اعراض البحة الصوتية:
     حدوث تغير في طبقة الصوت.
     يصبح الصوت به حده.
     تغيير ملحوظ في درجة ارتفاع الصوت.
نتيجه ذلك يصبح الصوت خشناً أو ضعيفاً
أو فاتراً.
اسباب بحة الصوت:
     إساءة إستعمال الصوت.
     التهاب في الحنجرة هو يكون بسبب عدوي
فيروسية في القناة التنفسية العلوية.
     أكياس الاحبال الصوتية وهي عبارة عن
كتل تظهر علي الأحبال الصوتية والتي
غالباً تكون نتيجة استعمال زائد للصوت.
     الارتداد المرئي وهو إرتداد الأحماض
من المعدة إلي الاحبال الصوتية.
     امراض الغدة الدرقية.
     التدخين والتعرض المستمر لأدخنة
السجائر.
     حدوث شلل في أعصاب الحنجرة أو تضرر
أعصاب الحنجرة بواسطة بعض العمليات
الجراحية.
     نزلات البرد والكحة الشديدة.

علاج البحة الصوتية:
يتمثل علاج بحة الصوت في علاج طبي وعلاج
تخاطبي مع اتباع العديد من الارشادات
الهامة ، وتتمثل أهمية كل جانب من
الجوانب السابقة في الآتي:
     يقوم أخصائي الأنف والأذن والحنجرة
بعمل الفحوصات اللازمة لمعرفة أسباب
البحة الصوتية واذا كان هناك مشكلة ما
تتعلق بالأحبال الصوتية للتأكد من مدى
سلامتها.
     يقوم أخصائي التخاطب بتقديم جلسات
التخاطب والتي تتمثل في مجموعة من
تدريبات الصوت التي تساعد علي التقليل
من حدة البحة الصوتية.
وكذلك تتمثل الإرشادات التي تساعد في
الخفض من حدة بحه الصوت في الآتي:
     شرب المياه بكثرة.
     التوقف عن التدخين.
     التوقف عن شرب الكحوليات.
     التخفيف من إستهلاك المشوربات التي
تحتوي علي الكافيين مثل القهوة والشاي.
     عدم شرب مشروبات شديدة البرودة أو
الحرارة.
     الحفاظ علي صوت منخفض ، أن الصياح
والصراخ والهتاف بصوت عالي أو التحدث
عبر ضوضاء عالية يؤدي إلي إجهاد أحبالك
الصوتية مما يسبب خشونة الصوت.
     عدم اجهاد الصوت وعدم التكلم بكثرة
اثناء الاصابة بالبحه الصوتية وذلك
لمنح الراحة الكافية لصوتك.
     تجنب الغناء أو التحدث بصوت عالي لفترة
طويلة أو أي شئ يجهد صوتك.
     أمنح صوتك قليل من الراحة قبل أن تتحدث
لفترات طويلة.
"""
    },
    {
      "name": "التدريب علي نطق حروف الجر للاطفال",
      "text": """في حالة ان ابنك ينطق حروف الجر مثل(ب –
في – علي – من – مع) داخل الجمل بشكل
خاطئ بحيث يخلط ما بينهم مثل “أقعد في
الكرسي” بدلاً من ” أقعد علي الكرسي”
أو ” أغسل سناني في الفرشة” بدلاً من
“أغسل سناني بـ الفرشة” ، فإنك بالطبع
تحتاج إلي تدريبه علي فهم حروف الجر
الشائعة والتمييز بينها وأستخدامها
بشكل سليم داخل الجمل ، وما يلي شرح
طريقة التدريب علي حروف الجر للاطفال
لتعليمهم استخدام حروف الجر في الجمل
بشكل صحيح.
التدريب على حرف الجر (ب) :
الأدوات: صور المجموعات الضمنية.
خطوات التدريب:
     نقوم بكتابة حرف الباء فى ورقة ونعرف
الطفل بإسمه بتكرار نطقه أمام الطفل
وإستخدام الحرف المكتوب علي ورقة يجعل
الطفل يدرك وجود الحرف بجعله شئ مادى
يسميه ويتعامل معه معاملة صور المجموعة
الضمنية.
     يتم التدريب على حرف الجر باء عن طريق
تدريب الطفل على إستخدامات الأشياء و
وظائف أعضاء الجسم.
     نضع صورة الحرف قبل صورة الكارت ونسأل
الطفل “أسرح شعري بايه؟ بـ فرشة” أو ”
أكتب بايه ؟ بـ قلم” ، “أشوف بايه؟ بـ
عيني ” ، “أسمع بايه؟ بـ وداني”.
     تعميم  المرحلة الأولى:
     يتم تدريب الطفل بدون استخدام الصور.
     سؤال الطفل عن اشياء اخرى في البيئة
مثل “أغسل سناني بايه؟” ، “أكل
بايه؟”.
     ملاحظة كلام الطفل اثناء اليوم
وتذكيره باستخدام الحرف “ب” في كلامه.
كما يستخدم حرف الباء مع الفعل المضارع
مثل “يأكل ، بيأكل” وتكون طريقة
التدريب مثل الطريقة السابقة بأستخدام
كروت الأفعال ، مثل : سؤال الطفل ” الولد
بيعمل ايه؟” وننطق ب ثم الفعل ، “بـ
يأكل”.
التدريب على حرف الجر (في) :
الأدوات: مجسمات وصور المجموعات
الضمنية.
خطوات التدريب:
     فى البداية لازم ندرب الطفل استقبالى
” يعنى يفهم معنى الحرف” مثل أن نطلب من
الطفل أن:
     وضع مكعب فى طبق.
     وضع معلقة فى الكوباية.
     بعد ما يتم تدريب الطفل استقبالي نبدأ
فى تدريب الطفل  على التعبير عن الحرف
في الجمل من خلال مرحلتين :
     المرحلة الأولى: وهو سؤال الطفل بجمل
تكون اخرها “فين؟”.
الأدوات المستخدمة:  صورة بها حرف الجر
“في” ، كروت الاماكن مثل مستشفى ،
مدرسة ، مثال:
     نضع كارت به صورة مدرسة يسبقه كارت به
الحرف “في”.
     نسأل الطفل “المدرس بيشتغل فين؟”.
     نساعد الطفل على الاجابة على  السؤال
والاشارة الى الحرف ثم المدرسة
والاجابة “في المدرسة”.
     تعميم  المرحلة الأولى:
     يتم تدريب الطفل بدون استخدام الصور.
     سؤال الطفل عن اشياء اخرى في البيئة
مثل “بابا فين” ، “الملابس فين؟”.
     المرحلة الثانية: نطلب من الطفل
التعبير عن مكونات الصورة بدون الحاجة
إلي سؤال “فين؟”.
مثال:
     نضع صورة اولاد في فصل واسأل الطفل
“الصورة فيها ايه؟”.
     نضع صورة مكعبات في العلبة واسأل الطفل
“الصورة فيها ايه؟”.
     تعميم المرحلة الثانية: يتم من خلال
ملاحظة كلام الطفل اثناء اليوم وتذكيره
باستخدام الحرف “في” في كلامه.

التدريب على حرف الجر (علي) :
الأدوات: مجسمات وصور المجموعات
الضمنية.
خطوات التدريب:
     فى البداية لازم ندرب الطفل استقبالى
” يعنى يفهم معنى الحرف” مثل أن نطلب من
الطفل أن:
     وضع مكعب علي طبق.
     وضع معلقة علي الكوباية.
     بعد ما يتم تدريب الطفل استقبالي نبدأ
فى تدريب الطفل  على التعبير عن الحرف
في الجمل من خلال مرحلتين :
     المرحلة الأولى: وهو سؤال الطفل بجمل
تكون اخرها “علي ايه؟”.
الأدوات المستخدمة:  صورة بها حرف الجر
“علي” ، صورة لأماكن مثل حائط أو كرسي ،
مثال:
     نضع كارت به صورة كرسي عليه كوب ويسبقه
كارت به الحرف “علي”.
     نسأل الطفل “الكوباية محطوطة علي ايه
؟”.
     نساعد الطفل على الاجابة على  السؤال
والاشارة الى الحرف ثم المدرسة
والاجابة “علي الكرسي”.
     تعميم  المرحلة الأولى:
     يتم تدريب الطفل بدون استخدام الصور.
     سؤال الطفل عن اشياء اخرى في البيئة
مثل “المفتاح محطوط علي ايه؟”.
     المرحلة الثانية: نطلب من الطفل
التعبير عن مكونات الصورة بدون الحاجة
إلي سؤال “علي ايه؟”.
مثال:
     نضع صورة ولد واقف علي الكرسي واسأل
الطفل “الصورة فيها ايه؟”.
     نضع صورة كتب علي الأرض واسأل الطفل
“الصورة فيها ايه؟”.
     تعميم المرحلة الثانية: يتم من خلال
ملاحظة كلام الطفل اثناء اليوم وتذكيره
باستخدام الحرف “علي” في كلامه.
التدريب على حرف الجر (من) :
الأدوات: صور المجموعات الضمنية
خطوات التدريب:
     فى البداية لازم ندرب الطفل استقبالى
” يعنى يفهم معنى الحرف” مثل أن نطلب من
الطفل أن:
     يحضر مكعب من أخيه.
     يحضر طبق من المطبخ.
     بعد ما يتم تدريب الطفل استقبالي نبدأ
فى تدريب الطفل  على التعبير عن الحرف
في الجمل من خلال مرحلتين :
     المرحلة الأولى: وهو سؤال الطفل بجمل
تكون اخرها “مين؟”.
الأدوات المستخدمة:  صورة بها حرف الجر
“من” ، صورة لأماكن مثل المكتبة أو محل
الخضار ، مثال:
     نضع كارت به صورة محل خضار يسبقه كارت
به الحرف “من”.
     نسأل الطفل “أجيب خضار منين؟”.
     نساعد الطفل على الاجابة على  السؤال
والاشارة الى الحرف ثم المدرسة
والاجابة “من محل الخضار”.
     تعميم  المرحلة الأولى:
     يتم تدريب الطفل بدون استخدام الصور.
     سؤال الطفل عن اشياء اخرى في البيئة
مثل “أشتري كراسة منين؟”.
     المرحلة الثانية: نطلب من الطفل
التعبير عن مكونات الصورة بدون الحاجة
إلي سؤال “منين؟”، مثال:
     نضع صورة ولد يشتري خضار واسأل الطفل
“الصورة فيها ايه؟”.
     نضع صورة ولد يشتري كراسة واسأل الطفل
“الصورة فيها ايه؟”.
     تعميم المرحلة الثانية: يتم من خلال
ملاحظة كلام الطفل اثناء اليوم وتذكيره
باستخدام الحرف “من” في كلامه.
التدريب على (مع) :
علي الرغم من أن “مع” قد لا يتم تصنيفها
كونها أحدى حروف الجر ، ولكن لأهميتها
نوضح كيفية التدريب عليها كذلك ، ويتم
تدريب الطفل من خلاص سؤاله عدة اسئلة
ونكرر الإجابة مع الطفل وتذكيره
باستخدام الحرف “مع” ، مثال: “جاى مع
مين؟ مع ماما” ، “أختك بتروح الدرس مع
مين؟ مع هدي” ، “بابا قاعد مع مين؟ مع
جدو”.
وبهذا نكون انتهينا من شرح حروف الجر
للاطفال وكيفية التدريب عليها بأسلوب
التخاطب.
"""
    },
    {
      "name": "فسيولوجية الصوت والكلام |أعضاء استقبال ومعالجة وإرسال الكلام",
      "text": """إن عملية استقبال ومعالجة وإرسال
الكلام (ممارسة الكلام) عملية معقدة
للغاية ، حيث يشترك فيها اكثر من جهاز من
أجهزة الجسم وتتكامل هذه الاجهزة
وتتفاعل مع بعضها البعض لتخرج في
النهاية الاصوات الكلامية ، وبدراسة
فسيولوجية الصوت والكلام ومعرفة أعضاء
النطق والكلام ومكونات جهاز السمع
ومراكز الكلام بالدماغ ، يمكنا فهم أكثر
طبيعة تلك العملية ، وتتمثل مجموعة
الأعضاء التي تتداخل معاً وتشكل
فسيولوجية الصوت والكلام في الآتي:
أولاً : الجهاز التنفسي:
يقوم الجهاز التنفسي بمهمة الاستقبال
والارسال الهوائي الداخل والخارج من
الرئتين , ويتألف من:
1- الأنف:
يدخل الهواء الى الجسم بواسطة فتحتي
الانف الخارجتان ، وتعمل على:
     تنقية الهواء عن طريق الشعيرات.
     تكييف الهواء الداخل للجسم عن طريق
الاغشية المبطنة للانف.
2- الرغامي:
 أو ما يعرف بالقصبة الهوائية وتمتد بين
الرئتين والحنجرة ويبلغ طولها 12 سم
تقريبا وعرضها 2,5 سم ، وهي عباره عن
حلقات غضروفية غير مكتملة على حرف C 
ويتكون الجزء الناقص من عضلات تساعدها
على التمدد والتقلص في الشهيق والزفير.
 القصبة الهوائية القصبة الهوائية
3- الرئتان:
 الى جانب الدور التي تقوم به الرئتان
في عملية التنفس فهي لها دور مهم في
عملية النطق فعن طريق تيار الزفير التي
تقوم به يتم انتاج الاصوات اللغوية.
4- الهيكل الصدري:
أو ما يعرف بالقفص الصدري ويحتوي على:
     الاضلاع.
     عظم القص.
     الحجاب الحاجز.
ثانياً: الجهاز الصوتي:
1- الحنجرة:
تقوم الحنجرة بوظيفيتين ، هما:
     الحارس الذي يحمي الرئتين من تسلل اي
جسم غريب مع الهواء الذي يمر.
     اخراج الاصوات اللغوية.
 الحنجرة الحنجرة
2- الطيات الصوتية:
هي عبارة عن احزمة لحمية مغطاه بغشاء
لزج تؤدي دورا مهما في اصدار الاصوات
اللغوية.
 الاحبال الصوتية الاحبال الصوتية
ثالثاً: اجهزة الرنين:
1- البلعوم الفموي:
أو البلعوم الأوسط ، ويمتد من العظم
اللامي إلى الفم ، وأهم أجزائه اللهاة
ولسان المزمار الواقع وسط هذا التجويف،
ويعد من أهم تجاويف.
2- البلعوم الانفي:
أو البلعوم العلوي، يقع فوق اللهاة
ويتصل بالجزء الخلفي من تجويف
الأنف.ويتحكم في هذا الجزء من البلعوم
صمام متحرك يسمى الصمام اللهوي
البلعومي مهمته سد هذا البلعوم وفصله عن
البلعوم الفموي في حالة البلع. ويتحكم
أيضا في نطق الأصوات الأنفية وتحديد
درجات رنينها في الأنف حين يغلق ممر
الهواء إلى الأنف إغلاقا غير تام لإحداث
الأصوات.
3- البلعوم الحنجري:
ويمتد من الغضروف الحلقي في أعلى القصبة
الهوائية حتى يصل العظم اللامي ويتصل
بالمريء.
 البلعوم البلعوم

رابعاً: أجهزة النطق:
وتعرف ايضاً بـ أعضاء النطق والكلام
وتتمثل في الآتي:
1- اللسان:
اللسان عضو هام في عملية الكلام، حتى إن
النطق ينسب إليه بصفة خاصة، بل إن اللغة
(اللسان) نفسها تسمى باسمه؛ فيقال:
اللسان العربي، واللسان عضو مرن يمكن
تحريكه في جميع الاتجاهات؛ لتكييف
الصوت اللغوي حسب أوضاعه المختلفة، حيث
يؤثر في مرور تيار الهواء عبر تجاويف
الفم، ويمتد إلى الأمام حتى يخرج من بين
الأسنان كما في نطق الثاء، وقد يلتصق
جزء منه بسقف الفم كما في نطق اللام
وهكذا. وقد قسم علماء الأصوات اللسان
إلى أقسام، يهمنا منها في هذا المقام
ثلاثة أقسام رئيسية، بعضها يتضمن
أقساما أخرى، وهي:
     طرف اللسان: وهو الجزء المقابل للثة
،ويدخل فيه ذولق اللسان.
     وسط اللسان: وهو الجزء الذي يقابل
الحنك الصلب المسمى بوسط الحنك.
     أقصى اللسان: وهو الجزء المقابل للحنك
اللين المسمى بأقصى الحنك.
2- الشفتان:
عضوان لحميان مرنان من أعضاء النطق
المتحركة ؛ حيث تتخذان أوضاعا مختلفة
حال النطق بعدد من الأصوات الاوضاع التي
تتخذها الشفتان من الناحية اللغوية:
     الوضع الدائري: تكون الشفتان مفتوحات
على شكل دائرة واسعة.
     الوضع المنبسط أو المفرود: تمطان
الشفتان خلالها متجهتين الى الجانبيين.
     وضع التدوير: تكون الدائرتان مضمومان
فيما يشبه الدائرة الصغيرة.
3- الأسنان:
وهي من أعضاء النطق الثابتة، وللأسنان
بنوعيها وظائف مهمة في نطق عدد من
الأصوات وتنقسم إلي قسمين:
     الاسنان العليا: وهي تشترك مع طرف
اللسان في نطق صوت (ت) ، كما انها تشترك
مع الشفة السفلى لنطق (ف) ، وتشترك مع
الاسنان السفى وطرف اللسان لنطق صوت (ث).
     الاسنان السفلى: يحدث في بعض الاحيان
ان يلامس طرف اللسان الاسنان العليا عن
نطق (ت ) كما ان الاسنان السفلى تشترك مع
العليا وطرف اللسان بينهما لنطق (ث-ذ-ظ).
4- اللثة:
نسيج ليفي ضام يغطيه من كلا الجانبيين
الغشاء المخاطي ويحيط هذا النسيج بأصول
الاسنان العليا والسفلى ، وهي تشترك مع
اللسان في نطق بعض الاصوات مثل: ت – د –
ط – ز – ث.
5- الحنك:
أو ما يعرف بسقف الحلق وينقسم الى 3
اجزاء:
     الحنك الصلب: وهو جزء عظمي يشمل على
ثلثي الحنك ويقع في مقدمة التجويف الفمي
ويتسم بالصلابة نسبيا لفصل الانف عن
الفم ، يساعد على اخراج اصوات وسط
اللسان ( ج – ي – ش ).
     الحنك اللين: الجزء الذي يقع في مؤخرة
التجويف الفمي ، ويعد من اعضاء النطق
المتحركة ، يساعد في اخراج اصوات مثل ( ق-
ك)
     اللهاة: هي جملة عضلات تربط الحنك
بالبلعوم وعند التقاء اللهاه بجدار
الحلق يتم سد التجويف الانفي بيسمح
بخروج الاصوات الفموية مثل (خ – غ- ق) ،
وعندما تنخفض للاسفل تسد التجويف الفمي
لتخرج الاصوات الانفيه مثل(م – ن).
6- الفك السفلي:
وهو العظمة الوحيدة القابلة للحركة من
عظام الوجه ، يتصل بالوجهه من خلال
غضاريف ، فمثلاً لإصدار صوت (أ) ينخفض
الفك السفلي الى اسفل ، وعند نطق صوت (ي)
يرتفع إلى أعلى ، وهكذا على حسب طبيعة
الاصوات اللغوية.
خامساً: الجهاز العصبي:
يتكون الجهاز العصبي من ثلاث اجزاء هم:
     الجهاز العصبي المستقل:
     الاعصاب الشوكية.
     الجهاز العصبي الباراسمبثاوي.
     الجهاز العصبي المحيطي:
     الاعصاب الشوكية.
     الاعصاب المحيطية.
     الجهاز العصبي المركزي:
     النخاع الشوكي.
     الدماغ.
وتحتوي الدماغ علي الاجزاء التالية:
     المخ.
     المخيخ.
     الدماغ البيني.
     ساق الدماغ.
اما المناطق المسئولة عن الكلام في المخ
فهي:
     المنطقة (38): وهي مسئولة عن تحويل
المثير البصري إلي شكل سمعي.
     المنطقة (41) و (42): ويختصوا بتسجيل
الأصوات بكل صفتها وهي تستقبل الأصوات
القادمة عبر العصبي السمعي.
     المنطقة (22): تعرف باسم المنطقة السمعية
الترابطية ، وهي مسئولة عن فهم وتفسير
الكلام وإتلاف هذه المنطقة يؤدي إلي
العمه السمعي.
     المنطقة (44): وهي المسئولة عن تشكيل
وبناء الكلمات والجمل ، أي تنظيم أنماط
الكلام.
سادساً: الجهاز السمعي:
وتنقسم كل أذن إلى ثلاثة أقسام رئيسية ،
هي: الأذن الخارجية ، والأذن الوسطى
والأذن الداخلية.
1- الاذن الخارجية:
     الصيوان.
     القناة السمعية الخارجية.
     طبلة الاذن.
2- الأذن الوسطي:
وهي تقع بين الاذن الخارجية والاذن
الداخلية ، وتتكون من:
     العظيمات الثلاث (السندان – المطرقة –
الركاب).
     قناة استاكيوس.
3- الأذن الداخلية:
     القوقعة.
     الدهليز.
     العصب السمعي.
     القنوات الهلالية.
     عضو كورتي.
"""
    },
    {
      "name": "الأبراكسيا | تعريف ، أنواع ، أعراض ، أسباب ، علاج   Apraxia",
      "text": """تعد الأبراكسيا من الاضطرابات الصعبة
نادرة الحدوث، والتي تعد تحدياً كبيراً
لدي الأخصائيين وأولياء الأمور لمواجهة
تلك المشكلة عند أطفالهم ، وقد يزداد
التحدي صعوبة اذا صاحبت الأبراكسيا
أحدي الاضطرابات الأخري مثل التوحد ،
عندها يصعب التحدي أكبر ولكن الأصرار
أكبر والوصول ليس بالمستحيل ، فالأصرار
والجهد يولد الحلول ، وبالعلم والعمل
يمكن اجتياز أصعب التحديات ، وفي هذا
المقال نوضح لك أهم النقاط الرئيسية
التي تخص الأبراكسيا حتي تكون عوناً لكم
ان شاء الله.
وفي هذا المقال تقرأ عن:
    ما هي الأبراكسيا
    أنواعها
    أعراضها
    أسبابها
    علاجها
أضغط علي الجزء المراد القراءة عنه
للانتقال إليه.
ما هي الأبراكسيا؟
الأبراكسيا Apraxia هي خلل في البرمجة
الصوتية واللغوية ، وهي أحدى اضطرابات
الكلام المرتبطة بتنسيق تسلسل الحركات
الخاصة بأنتاج الكلام (حركات اعضاء الفك
والشفاة واللسان) ، كما تُعرف بأنها نوع
من انواع مشاكل النطق والكلام عند
الأطفال بيحث تكون عضلاتهم الخاصة
بأعضاء النطق والكلام طبيعية ، ولكن لا
يستطيعوا التحكم فيها بالشكل الكافي
الذي يساعدهم علي النطق وتنسيق الأصوات
وتتابعها أثناء الكلمات ، وتعد من
الحالات نادرة الحدوث كما ترجع أسبابها
إلي أسباب عصبية.
أنواع الأبراكسيا :
1- الأبراكسيا النمائية DEVELOPMENT APRAXIA:
وهي نوع يصاب به الأطفال دون وجود خلل أو
مرض معروف في الدماغ.
1- الأبراكسيا المكتسبة ACQUIRED APRAXIA:
تصيب الصغار والكبار ، إلا إنها تصيب
الكبار أكثر نتيجة عوامل طبية مثل
(الجلطة الدماغية ، الاورام ، إلتهاب
المخ).
أعراض الأبراكسيا :
     اضطراب في نطق الأصوات أو الكلمات أو
المقاطع غير ناتج من ضعف او عجز في
العضلات، بل ضعف التنظيم والتنسيق و
التسلسل لحركات اعضاء (الشفاه
-الفك-اللسان).
     الطفل يعرف ما يريد أن يقول لكن الدماغ
لديه مشكلة في تنسيق حركات العضلات
الضرورية.
     تشوة في أصوات الحروف.
     إسقاط أو اضافة حرف مثل قلللم بدلاً من
قلم.
     التأخر في التواصل مع الأخرين.
     التأخر في الاستيعاب.
     حدوث مشاكل في الرضاعة.
     مشاكل في الاكل عند بعض الاطفال.
     صعوبة في البلع والمضغ.
     زيادة أو قلة الاحساس بالفم ، يرفض غسل
الاسنان أو تناول الأكل الصلب ، لا
يتعرف علي مذاق الاشياء بفمه.

أسباب الابراكسيا :
     مشاكل في الجين.
     أثر حادثة في الرأس.
     تلف في الدماغ أو سكته دماغية.
     وقد تصاحب بعض الاضطرابات مثل:
     توحد.
     متلازمة داون.
علاج الأبراكسيا :
     تكرار نفس الكلمة أو العبارة عده مرات.
     تدريب الطفل علي مقاطع وكلمات يساعد في
تعليم الانتقال من صوت الي اخر.
     التغذيه الراجعية من أكثر من حاسه مثل
التلميحات اللمسية والبصرية.
(مشاهدة الطفل لنفسه اثناء النطق في
المرآه ، الاحساس باللمس للمخارج
الصوتية)
     ممارسة الكلام أمام المرآه لجذب
انتباه الطفل وزيادة تركيزة مع الطبيب
في طريقه نطقه الصحيح.
     يجب علي الاخصائي فحص اعضاء النطق
بالكامل، وتسجيل للطفل أصواته ويبدأ
يسمعه وبعدها يبدأ تحسين ما تم الخطأ في
مع التصحيح والأعانه.
     التدريبات المنزليه مهمه جداً ، لابد
ان يعطي الاهل مهمات وتدريبات للمساعدة
في تقدم الطفل، ويفضل أن تطبق
استراتيجيات خارج مركز العلاج."""
    },
    {
      "name": "مراحل التدريب السمعي لضعاف السمع وزارعي القوقعة ",
      "text": """ لضعاف(Auditory Verbal Training)أن التدريب السمعي 
السمع يساعد بشكل كبير علي الاستفادة من
البقايا السمعية لأقصي درجة ممكنة
وتنشيطها وتوظفيها في الاصغاء والفهم
وتعلم اللغة. لذلك فأن له دور هام في
التحسين من كفاءة السمع لدي ضعاف السمع.
أما عن التدريب السمعي لزراعي القوقعة.
فعلي الرغم من قدرة الفرد علي السمع بعد
قيامه بعملية زراعة القوقعة، إلا انه
لابد من ألحاق الفرد بجلسات التأهيل
والتدريب السمعي، التي من شأنها أن تضع
البنايات الأولي للفهم والادراك السمعي
وبالتالي استغلال قدراته السمعية
الجديدة.
مراحل التدريب السمعي
1- الوعي بوجود الصوت AWARENESS OF SOUND:
ويتم ذلك من خلال تدريب الطفل علي الوعي
والشعور بوجود الصوت. وذلك من خلال جذب
انتباهه إلي اصوات تحدث في محيطه، وكذلك
ملاحظة ردود فعله التلقائية عند سماع
صوت معين. علي سبيل المثال : أن يلتفت
برأسه عند سماع صوت جرس المنزل ، الهاتف
، صوت طرق المعلقة بكوب.
2- تحديد مصدر الصوت LOCALIZATION OF SOUND:
وفيه يتم تدريب الطفل علي تحديد مصدر
الصوت، أي المكان الذي يأتي منه الصوت
سواء كان امامه أو خلفه ، يمينه أو
يساره. ويقصد ببساطة معرفة اتجاه الصوت
وموقعه. علي سبيل المثال: الوقوف في احد
جوانب الغرفة خلف الطفل دون أن يرانا،
ونصفق بيدينا وعلي الطفل النظر أو
الإشارة إلي الاتجاه الصحيح الذي نقف
فيه. أو تخبئة شئ يصدر صوت ويبحث الطفل
عن مكان ذلك الشئ.

3- التمييز السمعي الأصوات DISCRIMINATION OF
SOUNDS:
ويتم فيها تدريب الطفل علي تمييز أصوات
مختلفة من حيث النغمة والشدة ، مثل:
     الصوت المرتفع والصوت المنفخض.
     الصوت الطويل والصوت القصير.
     الصوت المتقطع والصوت المتصل.
     صوت رفيع (المرأة) وصوت غليظ (الرجل).
كذلك تمييز الأصوات البيئية ومعرفة
الشئ الذي يصدر منه ذلك الصوت. على سبيل
المثال: تدريب الطفل علي معرفة صوت
الكلب والأسد والقطة والخروف ، ثم نقوم
بتشغيل صوت الحيوان دون أن يري الطفل
صورته ، وعلي الطفل أختيار صورة الحيوان
الذي قام بسماع صوته.
4- التعرف علي الأصوات الكلامية
وتمييزها RECOGNITION OF SOUNDS & WORDS:
ويتم فيه تدريب الطفل علي تمييز أسماء
الأشخاص وأسماء الاشياء المحيطة به ،
مثل : أسماء اجزاء الجسم والحيوانات
والطيور والمواصلات، والاعتماد علي
حاسة السمع فقط عن طريق التعرف علي
الكلمة سمعياً. على سبيل المثال: نقوم
بتدريبه علي اسماء العديد من
المواصلات، مثل: عربية وقطار وسفينة ،
وبعد معرفته باسمائهم ، ندربه علي احضار
صورة الشئ عند سماع اسمه. فعندما نقول
هات عربية أو عربية ، فأنه يعطينا
صورتها ، وعندما نقول قطار ، يعطينا
صورة القطار.
اعتبارات يجب مراعاتها اثناء التدريب
السمعي:
     التأكد من عمل السماعات جيداً قبل
بداية كل جلسة.
     البطئ نسبياً عند نطق الكلمة حتي
يستطيع الطفل سماعها جيداً وتمييزها
وإدراك مقاطعها وأصواتها.
     البطئ اثناء نطق الجمل (تنفيذ الأوامر
مثلاً) حتي يستطيع الطفل سماع وتمييز
مكونات الجملة (الكلمات الموجودة بها).
     عدم المبالغ في ارتفاع الصوت اثناء
تدريب الطفل، ولكن يفضل جعل الصوت
مناسب، فلا يكون صوتك منخفضاً جداً ولا
عالي جداً فيزعج الطفل.
     البدأ بالأصوات والكلمات الغير
متشابهة في بداية التدريب والتدرج من
حيث الصعوبة.
     الجلوس بجانب الطفل أو خلفه للتأكد من
اخفاء حركة الشفاة اثناء نطق الكلمات
اثناء التدريب السمعي، حتي لا يقوم
الطفل باحضار الصورة معتمداً علي قراءة
حركة الشفاة، بدلاً من سماع الكلمة
نفسها وتمييزها.
     تقديم التعزيز المناسب للطفل للرفع من
روحه المعنوية ودافعيته للتدريب.
أقرا ايضاً : برنامج جش للتأهيل السمعي
اللفظي (جرس JARAS)
وبهذا نكون انتهينا من شرح مراحل
التدريب السمعي لضعاف السمع وخطوات
التأهيل السمعي بعد زراعة القوقعة
وأنشطة للمعاقين سمعياً لتنمية القدرة
علي السمع والاستفادة من بقايا السمع
لديهم."""
    },
    {
      "name": "الدليل الشامل المختصر لإضطراب الطلاقةاللفظية ",
      "text": """تعريف التعلثم
انقطاع في سريان الإيقاع الطبيعي
للكلام ، بسبب حدوث تكرار غير طبيعي
لإيقاع الكلام بحيث يلفت الانتباه، مما
يؤثر علي عملية التواصل أو يسبب الحزن
والأسى عند الشخص المتلعثم أو من يستمع
إليه (د/ احمد عكاشة). وكذلك يعرف التلعثم
بأنه توقف أو تكرار أو إطالة للإيقاع
الطبيعي للكلام (الكاتب).
أنواع التلعثم:
تتعدد وتتنوع أنواع التلعثم وترتبط
ارتباطاً وثيقاً بالفترة الزمنية التي
يظهر ويستمر فيه التلعثم عند الأطفال ،
وتتمثل انواع التعلثم في الآتي:
1- التلعثم الارتقائي:
يكون عارض عند الاطفال في مراحل
ارتقائية وهو مؤقت يظهر عادة بين سن
الثانية والرابعة من العمر وتستمر بضعة
أشهر فقط.
2- التلعثم المعتدل:
يبدأ بين سن ست وثماني سنوات من العمر
وتستغرق من سنتين إلي ثلاث سنوات.
3- التلعثم الدائم:
يبدأ بين سن الثالثة والثامنة من العمر
ويستمر مدة طويلة الا اذا تم علاجه
باسلوب فعال ، ويعد التلعثم الذي يظهر
بعد سن الخامسة أكثر خطورة من ذلك الذي
يظهر في عمر مبكر.
وقد صنف العالم (باي) أعراض التلعثم إلي
خمس جداول عيادية:
     تلعثم فسيولوجي اي من 3:6 سنوات للفت
الانتباة
     تلعثم تشددي بمعني الاطالة أو التكرار
في المقطع
     تلعثم ارتجافي اي تكرار المقطع
     تلعثم مختلط بمعني يجمع
     تلعثم تثبيطي أي عرقلة سريان الكلام
بطلاقة مع سلوك حركي متوتر يمس عضلات
الوجهة ويؤدي الي احمراره
تصنيفات اخري للتلعثم لـ د/ نهلة
الرفاعي هي :
     التوقف.
     التكرار.
     الاطالة.

الأعراض المصاحبة للتلعثم:
هناك العديد من الأعراض الجانبية
المصاحبة التي تظهر مصاحبه للتلعثم ،
والتي ترتبط بمدى الصعوبة التي يواجهها
الفرد عند محاولة الكلام بطلاقة
والتلغب علي مشكلة التلعثم التي تطغي
علي كلامه، وتتمثل تلك الأعراض
الجانبية المصاحبة في الآتي:
     تعقيدات الوجهة
     طرف العين
     بعض الحركات بالأيدي والأقدام
     تنفس غير منتظم بمعني نهجان في التنفس
مع سرعة في ضربات القلب
أقرا ايضاً : شرح تطبيق اختبار شدة
التلعثم لـ د. نهلة الرفاعي
فنيات تأهيل التلعثم:
لعلاج التلعثم عند الاطفال أو الكبار ،
لابد من اتباع العديد من الفنيات التي
تساعد في الخفض من شدة التلعثم وتأهيل
الفرد للكلام بطلاقة، وتتمثل في الآتي:
     تمارين الاسترخاء.
     التثاؤب.
     التنفس من البطن.
     الثقة بالنفس.
     الكلام ببطيء.
     الاستروميستا.
     المقاطع الصوتية لكوبر.
     اللفظ المنغم لسميث.
     الضوضاء البيضاء.
     عدم سماع المتلعثم لصوتة.
     السيكو دراما.
     الاشتراط  بنوعية.
     الممارسة السلبية.
     اللعب الغير موجهة.
     الكف.
     الحفظ.
     التظليل.
وبهذا نكون انتهينا من عرض كافة النقاط
الرئيسية التي تخص التلعثم بصورة شاملة
وبشكل مختصر وسريع، حتي تكون مرجعاً لكل
"""
    },
    {
      "name": "(ازدواجية اللغة) | متي يضر تعلم لغة ثانية طفلك؟ ",
      "text": """ثنائية اللغة عند الأطفال (ازدواجية
اللغة) من المواضيع الهامة جداً، والتي
لابد أن نعطيها الكثير من الاهتمام، فقد
تدفع طفلك إلى الأمام أو قد ترجعه خطوات
إلى الوراء.
يعبر مصطلح ثنائية اللغة عن عملية يتعلم
فيها الفرد لغة أو أكثر بجانب لغته
الأم، مثل: تعلم اللغة الانجليزية
مثلاً (اللغة الثانوية) بجانب اللغة
العربية (اللغة الأم). وتؤثر تلك الظاهرة
علي الأطفال في حالة عدم اكتمال اللغة
الأم لديهم (اللغة العربية في حالتنا)،
وكذلك تتسع لتؤثر في كافة مهارات اللغة
من استماع وحديث وقراءة وكتابة. ولكن
تأثيرها الأكبر يكن في مهارتي الاستماع
والتحدث.
فاللغة هي واحدة من أهم عناصر التعلم
التي ينبغي أن تتطور لدي الطفل في مرحلة
ما قبل المدرسة، وهي أساس حياته
الاجتماعية والتعليمية. واحتكاك اللغة
بغيرها من اللغات يؤثر عليها سلباً أو
إيجاباً، وفتتخلخل في لغة الطفل لغات
أخرى، وتؤدي إلي تغيرها تغيراً معيناً
بقدر ما اكتسبت من صفات وخصائص من
اللغات الاخري.
كما أن الطفل يكتسب أساسيات لغته ليعبر
بها عن نفسه. فإذا أدخلت له لغة ثانية في
مراحل نموه الأولى وقبل اكتمال اللغة
الأم لديه، فسوف تؤثر اللغة الثانوية
الجديد علي اكتساب المهارات اللغوية
للغته الأم وقد تسببه له اضطراب بها.
وتقرأ في هذا المقال عن:
     ما معني ثنائية اللغة (ازدواجية اللغة)
     تأثيرها علي الاطفال؟
     سلبياتها : المشكلات التي تسببها عند
الاطفال 
     ايجابياتها : هل يجب عدم تعليم الطفل
لغة ثانية علي الاطلاق؟
     تلخيص الموضوع ورأيي كمختص في النطق
والكلام
ما معني ثنائية اللغة (ازدواجية اللغة)؟
ثنائية / ازدواجية اللغة هي تعلم لغتين
أو اكثر في نفس الوقت، أو تعليم لغة
اضافية مع الاستمرار في تطوير اللغة
الأولى (اللغة الأم).
وهناك فرق بين ثنائية اللغة وبين متعدد
اللغات. فالشخص الذي يتحدث لغتين فقط
يطلق عليه ثنائي اللغة. بينما الشخص
الذي لديه اكثر من لغتين ويتحدث بهما
بطلاقه يطلق عليه متعدد اللغات.
تأثيرها علي الاطفال؟
أكدت بعض الأبحاث أن للثنائية اللغوية
تأثيرًا سلبيًا على النمو اللغوي للطفل
في حال قُدمت اللغة الثانوية قبل اكتساب
واكتمال نمو اللغة الأساسية. يظهر هذا
التأثير ليس فقط في المجال اللغوي بل
يمتد ليؤثر على النمو المعرفي
والتعليمي للطفل. ونتيجة لذلك، يعاني
نسبة كبيرة من الأطفال من صعوبات في
تطوير لغتهم. تتجلى بعض الصعوبات
الناتجة عن ثنائية اللغة عند الطفل في
النقاط التالية:
     عدم القدرة علي فهم الكلمات.
     صعوبة في التعبير بالكلمات.
     صعوبة في اتباع التعليمات وتنفيذ
الأوامر.
     استخدام اللغه بطريقه غير مناسبة
واستخدام الكلمات في سياقات غير مناسبة
وتداخل كلمات اللغتين في بعضهما البعض
(التداخل اللغوي).
     اضطرابات اللغة هي من أكثر الاضطرابات
شيوعآ ،وهي تتمثل في صعوبات إكتساب
اللغة واستخدامها. ويرجع ذلك لانخفاض
المفردات (حصيلة الكلمات) ،وضعف بنية
الجملة ومحدوديتها وضعف الحديث.
مثال: بعض الأطفال يستخدمون كلمات من
لغة ثانية بديلة عن الكلمة الأساسية في
لغتهم الأم. فيستخدمون كلمة “Apple”
بدلاً من “تفاحة” أو “Sleep” بدلاً من
“أنام”. وهذا قد يؤدي إلى صعوبات
واضطرابات في استخدام اللغة، على سبيل
المثال، يمكن أن يقول الطفل: “أنا عايز
أكل Apple”، “ماما عايز Sleep”. كما قد
يواجه صعوبات في فهم الكلام واتباع
التعليمات. على سبيل المثال، إذا قدمت
له صورة لتفاحة وطلبت منه أن يحضر
التفاحة، قد لا يستطيع لأنه لا يعرف أن
ذلك الشيء يسمى تفاحة، إذ سمع في العديد
من المرات كلمة “Apple” كاسم له.
أقرا ايضاً : اضطرابات النطق عند
الاطفال (اللدغات) – مظاهر ، انواع ،
علاج
المشكلات التي تسببها ثنائية اللغة عند
الاطفال:
هناك عدة مشكلات قد تحدث للطفل في حالة
تعلم لغة ثانية جديدة في سن صغيرة جداً
وقبل اكتمال نمو اللغة الأم لديه، أو في
حالة تعلم لغة جديدة علي الرغم من انه
يعاني من تأخر في اللغة الأم لديه.
وتتمثل بعض سلبيات ثنائية اللغة
ومشكلاتها عند الطفل، في ما يلي:
     يعاني الأشخاص ثنائي اللغة بشكل عام من
عده مشكلات مثل النمو اللغوي والمعرفي
والإجتماعي ، فتلك المهام تتأثر في حالة
التداخل بين اللغات.
     قد يعاني طفل من صعوبة في التطور
المعرفي أكثر من طفل ذو لغه احادية.
     قد يعاني الطفل من مشاكل تعليمية ناتج
عن نقص الكفاءة اللغوية.
     قد تؤثر علي الإنتباه التنفيذي لدي
أطفال ما قبل المدرسة.
     تجعل هؤلاء الأطفال لديهم كلمات أقل
ونطقهم ضعيف عند مقارنتهم بالأطفال
احادي اللغة.

الإجابة هي لا، لا تكمن المشكلة في
تعليم الطفل لغة ثانية، ولكن تكمن
المشكلة في التوقيت الذي تقوم فيه
بتعليم ابنك اللغة الثانية. فإذا كان
طفلك في المراحل الأولية لتعلم اللغة
الأم، بمعنى أنه لم تكتمل اللغة الأم
لديه، إذا قدمت له لغة ثانية قد تسبب له
مشكلات واضطرابات في اللغة الأم. أما
إذا كان طفلك قد أتم بالفعل تعلم لغته
الأم وأصبح يستطيع الحديث معك بطلاقة،
فلا مانع من تعلم لغة أخرى على الإطلاق.
بل إن تعلم لغة ثانية له أمرٌ هامٌ
للأطفال، وتتمثل إيجابيات ثنائية اللغة
وأهمية تعلم لغة ثانية للطفل في ما يلي:
     التقدم بين المجتمعات والثقافية
والتطور المتسارع في وسائل الإتصال
والتكنولوجيا وزيادة الوعي بها وتبادل
الثقافات بين الشعوب. حتم علي الآباء
السعي لتعلم أبنائهم منذ الطفولة لغة
اخري لمواكبة التطور واعدادهم للمستقبل
وذلك من خلال ادخالهم المدارس الدولية
في المجتمعات العربية.
     اغلب المجتمعات العربية اعتمدت علي
اللغة الإنجليزية كلغه ثانية بجانب
اللغة العربية (الأم).
     يرى البعض أنه من السهل تعلم الطفل في
مرحله الطفولة لغتين لأن بعد ذلك يصبح
من الصعب إكتساب لغة اخري.
     يرى البعض أن ليس من الصعب اكتساب
لغتين للطفل ما دام ان الأشخاص المحيطين
بالطفل يتحدثون معه بانتظام باللغتين ،
فأصبح لدي الطفل تطور في النمو المعرفي
والإدراكي والتعليمية وبالتالي في
حياته ومهاراته الإجتماعية.
تلخيص الموضوع ورأي كمختص في النطق
والكلام:
أرى أن إدخال لغة ثانية للطفل قبل
الأربع أو الخمس سنوات الأولى من عمر
الطفل دون اكتمال لغته الأم، قد يؤثر
بشكل كبير على اللغة لديه وقد يؤدي إلى
اضطراب فيها وربما يصيب الطفل بتأخر في
الكلام. أما بعد اكتمال لغته الأم، فلا
توجد أي مشكلة في تعلم لغة ثانية.
"""
    },
    {
      "name": " الإيكولاليا | ترديد الكلام عند الاطفال : اسباب ، انواع ، علاج",
      "text": """تعريف الإيكولاليا ECHOLALIA
تنقسم كلمة “إيكولاليا” (Echolalia) إلى
جزئين، حيث يأتي “ECHO” بمعنى ترديد أو
صدى، و”LALIA” تأتي في اللغة اليونانية
القديمة بمعنى صوت أو نغمة. وبذلك، فإن
الكلمة كاملة “ايكولاليا” (Echolalia) تعني
ترديد الصوت أو ترديد الكلام أو
المصاداة.
الإيكولاليا أو المصاداة هي اضطراب
لغوي يأتي بشكل تكرار للكلام بدون فهم
أو إدراك للكلام بشكل كامل في محاولة من
الطفل للتواصل اللغوي مع من يحدثه أو
المحيطين به بشكل عام.
انواع الايكولاليا
ينقسم اضطراب ترديد الكلام إلي 3 أنواع
هما:
     الإيكولاليا الفورية: هي أن يقوم الطفل
بترديد السؤال أو الكلمة التي قام
بسماعها في نفس الوقت أو بعد الوقت
بلحظات، وغالبًا ما يكون بنفس الطريقة
التي سمع بها الكلمة.
     الإيكولاليا المؤجلة: أن يقوم الطفل
بترديد الكلمة أو السؤال أو الجملة التي
قام بسماعها بعد دقائق أو ساعات أو أيام.
– ملحوظة: في ذلك النوع، يكون الطفل
أكثر إدراكًا وفهمًا للغة من الطفل الذي
لديه إيكولاليا فورية.
     الإيكولاليا المخففة: أن يقوم الطفل
بتكرار الكلمة أو السؤال أو الجملة التي
سمعها ولكن في سياق موقف مشابه للموقف
الذي سمع به الجملة، وتوظيف الجملة بشكل
بسيط للتناسب مع الموقف. وهنا يكون
الطفل أكثر إدراكًا وفهمًا للغة من
الأطفال الذين يعانون من الإيكولاليا
الفورية أو المؤجلة.

اسباب الإيكولاليا
هناك عدة أسباب قد تكون سبباً لترديد
الكلام دون فهمه ، نوضح بعضها في الآتي:
     التلقين: مثال: طفل لديه بعض المشكلات
اللغوية أو تأخر كلام، فيقوم الأهل بعمل
كورس تخاطب مع الاخصائي بطريقه التلقين
فقط المعتمدة على ترديد الكلام خلف
المختص بدون فهم.
     الاغاني: التي تحتوي علي كلمات متكررة
فيقوم الطفل بتكرار الكلام معها دون
فهمها او توظفيها بشكل سليم.
     اضطراب التوحد: فالطفل ذوي اضطراب طيف
التوحد يكون غير قادر ع التواصل ، فيقوم
بترديد الكلام محاوله منه لجذب
الانتباه او التواصل مع من حوله.
     التوتر والضغط: من العوامل التي تسهم
في وجود الإيكولاليا، هي أن الطفل قد
يقوم بتكرار الكلام محاولًا خفض حدة
التوتر والضغط لديه.
أخيرًا، يمكن أن تجتمع عدة أسباب من ما
ذكر سابقًا في ذلك الاضطراب، أو يمكن أن
يكون هناك سبب واحد فقط أو أسباب أخرى.
اقرأ ايضاً : أعراض التوحد ، تأخر اللغة
عند الأطفال
علاج الإيكولاليا
لكل اخصائي طريقته ليخفف من
الايكولاليا ولكن الهدف الرئيسي هو
زيادة الادراك اللغوي لتقل الايكولاليا
لان العلاقة بينهم عكسية ولذلك إليك بعض
طرق علاج الايكولاليا :
1- التدريب علي الاسئلة:
وذلك بهدف تدريب الطفل، عند توجيه
السؤال له، يقوم بالرد وليس بتكرار
السؤال. نبدأ بالمساعدة الكلية حيث أسأل
الطفل وأجاوب في نفس الوقت: “اسمك
إيه؟” – “حمزة”. ثم أكرر السؤال:
“اسمك إيه؟” – “حمزة”. فيبدأ الطفل
بتكرار آخر كلمة قالها. عندما أقول:
“اسمك إيه؟” يرد بآخر كلمة ويقول:
“حمزة”.
ملحوظة: من الممكن أن يكون مع الطفل
اخصائي آخر يجلس خلفه يرد عندما أسأل،
والطفل يكرر إجابة الاخصائي. مثال: (أنا
والطفل واخصائي آخر يجلس خلف الطفل،
وأنا أسأل الطفل: “اسمك إيه؟”، وقبل أن
يكرر الطفل السؤال، الاخصائي الآخر يرد:
“حمزة”، فيكرر الطفل كلمة “حمزة”
كآخر كلمة سمعها).
ونقوم بتكرار هذه الطريقة مع صيغة
الأسئلة المختلفة ونقلل المساعدة
تدريجياً حتى يفهم الطفل معظم الأسئلة،
ويفهم أنه يحتاج إلى الرد على السؤال
بدلاً من ترديده. فعندما نسأله سؤالًا
مثل: “ما هذا؟” يجيب مباشرة باسم الشيء.
ويُراعي تدريب الطفل على الرد بكلمة
“لا أعرف” أو “معرفش” حتى يستطيع
الإجابة على الأسئلة التي لا يعلم
إجابتها، مثل: “ما هذا؟” – “لا أعلم”
أو “ايه ده؟” – “معرفش”.
2- التدريب علي تنفيذ الاوامر:
وفيها يتم تدريب الطفل على فهم وتنفيذ
الأوامر بغرض زيادة الإدراك اللغوي
لديه وفهم الأوامر وتنفيذها بدلاً من
ترديدها. مثل: “هات”، “خد”، “تعال”،
“أقعد”، ويُراعى أن يقوم الطفل بتنفيذ
الأمر فقط دون ترديده.
3- التدريب علي الطلب:
تدريب الطفل على بدء التواصل، عن طريق
التعبير عن الأشياء التي يريدها بنفسه
من خلال مهارة الطلب. مثال: نحضر مجموعة
من الأشياء التي يحبها الطفل حتى ينجذب
إليها ويرغب في الحصول عليها، ثم نقوم
بتدريبه على كلمة “أنا عايز”، فيقول:
“أنا عايز تفاحة”، ثم نعطيه التفاحة
ونشجعه حتى يفهم الطلب ويقوم به بنفسه
بدون مساعدة.
ملحوظة: هذه الخطوات الأساسية لتقليل
الإيكولاليا، ولكن كل أخصائي له
استراتيجيته وطريقته الخاصة ليتمكن من
تطبيق هذه الخطوات لتحقيق الهدف
المطلوب والوصول إلى تقدم حالة الطفل.
اسئلة شائعة عن الإيكولاليا (ترديد
الكلام عند الاطفال):
هل الطفل الذي يعاني من الإيكولاليا
يعاني بالتابعية من اضطراب طيف التوحد؟
لا، ولكن ترتبط الإيكولاليا بـ اضطراب
طيف التوحد لسببين. أولًا، لأن معظم
الأطفال ذوي اضطراب طيف التوحد
الناطقين يعانون من الإيكولاليا في
مرحلة من مراحل تطور اللغة لديهم بنسبة
كبيرة قد تصل إلى 80 أو 85 في المئة منهم.
ثانيًا، الإيكولاليا تأخذ شكلًا من
الروتينية، والتي يتسم بها أطفال
اضطراب طيف التوحد.
أقرا ايضاً : أسباب التوحد
هل الطفل الذي يعاني من الإيكولاليا
يكون التعامل معه لغوياً بالتلقين فقط؟
لا، الطفل بعد ذلك أو في حياته الطبيعية
لا يتعامل بالتقليد أو الحفظ. طريقة
التلقين في البداية فقط لتبسيط
المعلومات وإيصال بعض المفاهيم الخاصة
بالفهم للغة وإدراكها ووعيه بها. وبعد
ذلك تأتي التدريبات الخاصة بالإدراك
اللغوي التي تخفف من حدة الإيكولاليا
(Echolalia) وكذلك التعامل بالتلقين.
لماذا يقوم الطفل بالاستجابة مع أشخاص
معينة ولا يقوم بالاستجابة مع كل
الأشخاص بعد القيام بتدريبه ع بعض
الاسئلة؟
الطفل يستجيب مع أشخاص معينين دون
غيرهم، أي يقوم بترديد الكلام معهم فقط.
وذلك لأن التدريب ينقسم إلى مراحل، حيث
يتقدم التدريب بشكل مفهوم، أي يقوم
الطفل بالاستجابة مع المختص، ثم يتبعه
التعميم. وذلك بتعميم استجابة الطفل مع
أخصائي آخر، وولي الأمر، والأهل،
وغيرهم. فعندما ينتقي الطفل الاستجابة
مع شخص معين، فإن هذا يعني أن الطفل
يحتاج إلى التعميم لما تدرب عليه.
وبهذا نكون قد انتهينا من عرض أهم
النقاط التي تتعلق باضطراب ترديد
الكلام عند الأطفال (المصاداة
الكلامية).
"""
    },
    {
      "name": " عشر نصائح لتعليم الأطفال النطق وتطوير الكلام لديهم ",
      "text": """تعليم الأطفال النطق والكلام هو مسألة
هامة تشغل بال الكثير من الآباء
والأمهات، وقد تسبب لهم الكثير من القلق
في بعض الأحيان. لذلك وفي هذال المقال،
نقدم إرشادات ونصائح هامة تلعب دوراً
كبيراً في تعليم الأطفال النطق وتطوير
لغتهم، كما تصلح هذه النصائح لجميع
الأطفال وخاصة الأطفال الذين يعانون من
تأخر الكلام.
نصائح تساعد في تعليم الأطفال النطق
والكلام:
تتمثل أهم النصائح والإرشادات التي
تساعد في تعليم الأطفال النطق والكلام
وتنمية اللغة لديهم فيما يلي:
1 – أجعل كلامك مع ابنك واضحاً وسهلاً:
حاول أن يكون كلامك معه عبارة عن جمل
بسيطة وقصيرة، وليست معقدة أو طويلة.
تكلم بأسلوب يناسب سن الطفل بحيث يستطيع
فهم الكلام والتعلم منه وتقليده بسهولة.
2 – أنطق مخارج الحروف بوضوح:
أنطق مخارج الحروف بشكل واضح، ولا تنطق
الكلمة بسرعة. كن بطيئًا نسبيًا أثناء
النطق، حتى يستطيع ابنك سماع الكلمة
وفهمها جيدًا، ويمكنه تسجيلها وحفظها
ليتمكن من نطقها فيما بعد.
3 – أنطق اسماء الأشياء بأستمرار:
انطق أسماء الأشياء التي يراها ابنك
والتي تقع حوله بشكل مستمر. البيت هو
أفضل بيئة لنمو لغة الأطفال، وكلما نطقت
أسماء الأشياء من حولكم لطفلك، كلما
ساعدته على التعرف على أسماء الأشياء
وتنمية الحصيلة اللغوية لديه.
وبالتالي، يمكن تعزيز تطور وازدهار
لغته.
4 – كن مثل معلق مباريات كرة القدم:
يقوم المعلق بالتعليق على كل أحداث
المباراة، علق أنت كذلك على كل الأحداث
والمواقف التي تحدث في المنزل أو الشارع
أو النادي. ذلك يساعد ابنك على تنمية
لغته وتطويرها، وكذلك يساعد على فهم
وإنتاج الجمل لديه بشكل أفضل وأوسع.
مثال: أحمد أخوك بيلعب بالكروة. ماما
بتغسل الأطباق. بابا بيتفرج علي
التلفزيون.
5 – تدريب الطفل علي تنفيذ الاوامر:
أطلب من ابنك تنفيذ أوامر واتباع
تعليمات باستمرار، وذلك لتزيد من فهمه
للغة وكذلك لمراجعة الكلمات التي
علمتها له. مثال: “أعطني موزة، أقفل
الباب، خذ الملعقة، أعطي الهاتف
لبابا.”
أقرأ ايضاً : 4 خطوات لتعليم الاطفال نطق
كلمات كثيرة
6 – أستمع لطفل جيداً وأهتم بكلامه:
أبتسم لابنك عندما تتحدث معه وحين تستمع
إلى كلامه. استمع إليه بانتباه وقم
بتشجيعه باستمرار عندما يحاول النطق
والكلام، خاصةً عند مواجهة كلمات صعبة.
كلما شعر الطفل بأن الآخرين يحبون كلامه
ويشجعونه عليه، كلما زادت رغبته في
التحدث أكثر وأكثر.

7 – دع طفلك يحاول من نفسه:
دع الطفل يحاول التعبير عن رغباته
واحتياجاته كما لو أنك لا تفهم ماذا
يريد. على سبيل المثال، إذا كان جائعًا
ويريد الأرز، قل له: “ماذا تريد؟ أنا لا
أفهم، قل لي ماذا تريد.” أعطه فرصة
للتعبير، حتى لو كان بصوت بسيط أو بجملة
بسيطة إذا كان يستطيع نطق الجمل. إذا نجح
في ذلك، شجعه وكافئه، وقم بتلبية رغبته.
وإذا لم يستطع على الرغم من محاولاته،
قم أنت بنطق الكلمة أمامه عدة مرات، ثم
أعطه ما يريد، ليتعلم الكلمة وكيفية
نطقها، وسيحاول نطقها في المرات
القادمة.
8 – لا تجعل طفلك يقلق من الكلام !
لا تجبر ابنك على الكلام، خاصةً مع
الآخرين وخاصة الغرباء. إجبار الطفل على
الكلام قد يشعره بالتوتر والخجل،
وبالتالي يؤثر على إنتاجه للكلام. لذلك،
اترك ابنك يتحدث مع الأشخاص الذين
يحبهم، والذين يشعر بالراحة والسرور
أثناء التعامل معهم.
9 – لا تضع طفلك في مواقف ضاغطة:
لاتضع ابنك في موقف الاختبار طوال الوقت
بهدف مراجعة الكلمات والجمل. لا تطرح
الأسئلة باستمرار حول أسماء الأشياء
واستخداماتها، ولكن استخدم الكلمات
والجمل وحفزه على نطقها في سياقاتها
الطبيعية. إذا أردت مراجعة معه، فكن أنت
الذي ينطق ويوضح ويتحدث عن الأشياء حتى
يتذكر ما قمت به له. إذا كان ابنك يذهب
إلى جلسات التخاطب، يمكنك مراجعة ما تم
تعلمه في تلك الجلسات يوميًا، ولكن لا
تجعل كل اليوم يكون مخصصًا للمراجعة
بشكل صريح.
10 – الأسرة حجر الأساس:
أعلم أن البيئة تشكل حجر الأساس في تعلم
الأطفال النطق والكلام، وأنك كوالدين
تشكلون جزءًا هامًا من بيئة الطفل. كلما
تفاعلت وتحدثت مع طفلك بشكل أكبر، زاد
تطور الكلام وتحسنت مهاراته اللغوية.
ويمكنك أيضًا تحميل تطبيق “كلماتي” من
جوجل بلاي لتعليم الأطفال النطق
والكلام، حيث يمكنك من خلال التطبيق
تعليم طفلك نطق أسماء أجزاء الجسم
والخضروات والفواكه والحيوانات
والطيور والملابس ووسائل المواصلات
وأجزاء المنزل.
"""
    },
    {
      "name": " الإيكولاليا | ترديد الكلام عند الاطفال : اسباب ، انواع ، علاج",
      "text": """ """
    },
    {
      "name": " الإيكولاليا | ترديد الكلام عند الاطفال : اسباب ، انواع ، علاج",
      "text": """ """
    },
    // ... Add more buttons as needed
  ];

  @override
  Widget build(BuildContext context) {
    final theme = Theme.of(context);
    final customTheme = theme.customThemeData;

    return Scaffold(
      appBar: AppBar(
        title: Text('التلعثم'),
        backgroundColor: isDarkModeActive
            ? customTheme.darkPrimaryGradient.colors[0]
            : customTheme.lightPrimaryGradient.colors[0],
      ),
      body: Padding(
        padding: const EdgeInsets.all(16.0),
        child: ListView.builder(
          itemCount: buttonsData.length,
          itemBuilder: (context, index) {
            return _buildSymptomCard(
              context: context,
              icon: Icons.record_voice_over,
              text: buttonsData[index]["name"]!,
              isDarkModeActive: isDarkModeActive,
              preFilledText: buttonsData[index]["text"]!,
            );
          },
        ),
      ),
    );
  }

  Widget _buildSymptomCard({
    required BuildContext context,
    required IconData icon,
    required String text,
    required bool isDarkModeActive,
    required String preFilledText,
  }) {
    return Card(
      color: isDarkModeActive ? Colors.transparent : Colors.white,
      elevation: 5,
      shape: RoundedRectangleBorder(
        borderRadius: BorderRadius.circular(10),
      ),
      child: InkWell(
        onTap: () {
          Navigator.push(
            context,
            MaterialPageRoute(
              builder: (context) => StutteringDetailScreen(
                title: text,
                preFilledText: preFilledText,
              ),
            ),
          );
        },
        child: Padding(
          padding: const EdgeInsets.all(16.0), // Add padding inside the button
          child: Column(
            mainAxisAlignment: MainAxisAlignment.center,
            children: [
              Icon(
                icon,
                size: 40, // Larger icon size
                color: isDarkModeActive ? Colors.white : Colors.black,
              ),
              SizedBox(height: 10),
              Text(
                text,
                textAlign: TextAlign.center, // Center text alignment
                style: TextStyle(
                  fontSize: 18, // Larger font size for readability
                  fontWeight: FontWeight.bold,
                  color: isDarkModeActive ? Colors.white : Colors.black,
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}

class StutteringDetailScreen extends StatelessWidget {
  final String title;
  final String preFilledText;

  StutteringDetailScreen({
    required this.title,
    required this.preFilledText,
  });

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(title),
      ),
      body: Padding(
        padding: const EdgeInsets.all(16.0),
        child: SingleChildScrollView(
          child: Column(
            crossAxisAlignment: CrossAxisAlignment.start,
            children: [
              Text(
                title,
                style: TextStyle(
                  fontSize: 24, // Title font size
                  fontWeight: FontWeight.bold,
                  color: Theme.of(context).brightness == Brightness.dark
                      ? Colors.white
                      : Colors.black,
                ),
              ),
              SizedBox(height: 20),
              Text(
                preFilledText,
                textAlign: TextAlign.right,
                style: TextStyle(
                  fontSize: 18, // Main text font size
                  height: 1.5, // Line height for readability
                  color: Theme.of(context).brightness == Brightness.dark
                      ? Colors.white
                      : Colors.black,
                ),
              ),
            ],
          ),
        ),
      ),
    );
  }
}
